[
  {
    "product_name":"COSRX – Hyaluronic Acid Intensive Cream, 100ml",
    "brand":"COSRX",
    "category":"Bulk Moisturizer, COSRX",
    "ingredients":"COSRX – Hyaluronic Acid Intensive Cream – 100 ml – a deeply hydrating cream designed to envelope dry or dehydrated skin in lasting moisture without feeling heavy or greasy. Product contains: Hippophae Rhamnoides (Sea Buckthorn) Water (~57.8%) – rich in antioxidants and essential nutrients to restore vitality and defend against environmental stress. Sodium Hyaluronate (Hyaluronic Acid, 3 000 ppm) – potent humectant that draws in and retains moisture for a plump, smooth complexion. Panthenol (Vitamin B5) – soothes and supports the skin barrier for enhanced comfort. Macadamia Seed Oil & Sunflower Seed Oil – nourishing lipids that help lock in hydration and soften the skin’s surface. Allantoin – calms and protects sensitive or stressed skin. Product effects: deeply hydrates and replenishes moisture for soft, supple skin, strengthens and restores the skin’s barrier function, helping reduce dryness and tightness, leaves skin smoother, refreshed and with a healthy glow — without an oily or heavy finish. Recommended for: dry, dehydrated or rough skin needing a moisture boost, skin that feels tight or uncomfortable, particularly in colder or dryer conditions, those seeking a barrier-nurturing cream that still absorbs well and layers easily. How to use: After cleansing and toning, take an appropriate amount and apply evenly to the face and neck. Gently pat with fingertips until fully absorbed. Use morning and evening; follow with sunscreen during the day. Capacity: 100 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"100ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/res_a1d940c93f8f1352638139d61e77dea9-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/cosrx-hyaluronic-acid-intensive-cream-100ml\/"
  },
  {
    "product_name":"Cos de BAHA – Vitamin C Facial Serum with MSM, 30ml",
    "brand":"Cos de BAHA",
    "category":"Bulk Serums, Cos de BAHA",
    "ingredients":"Cos De BAHA – Vitamin C Facial Serum with MSM – 30 ml – a brightening serum formulated with a stable form of vitamin C, organic sulfur (MSM), and a hydrating complex to visibly even skin tone, reduce the appearance of dark spots, and boost skin’s radiance. Suitable for many skin types, including those concerned with pigmentation, uneven texture, or dullness. Product contains: Sodium Ascorbyl Phosphate (Vitamin C derivative) – brightens the skin, reduces the appearance of dark spots, and offers antioxidant protection. MSM (Dimethyl Sulfone, “Nature’s Beauty Mineral”) – supports collagen production, helps reduce inflammation, and improves texture and elasticity. Ferulic Acid – a plant-based antioxidant that enhances the efficacy of vitamin C and provides extra protection against environmental stress. Tocopheryl Acetate (Vitamin E derivative) – moisturizes and protects the skin, complementing vitamin C’s effects. Hyaluronic Acid – deeply hydrates, plumping the skin and reducing the appearance of fine lines. Aloe Barbadensis Leaf Extract & Allantoin – soothe and calm the skin, making the formula gentler and suitable for sensitive skin. Product effects: brightens dull or uneven skin tone and helps fade dark spots, improves skin texture and smoothness, hydrates and plumps the skin for a healthier glow, supports collagen and elasticity for sturdier skin, leaves skin looking clearer, refreshed, and radiant. Our cosmetologist recommends this product in case of: uneven skin tone, pigmentation or post-acne marks, dull skin lacking radiance, early signs of aging such as loss of firmness or fine lines, skin that needs both brightening and barrier-supporting care. How to use: After cleansing and toning, apply 2–3 drops of the serum evenly to the face and neck. Gently pat until fully absorbed. Follow with moisturizer and, if used in the morning, finish with sunscreen. Use morning and\/or evening for best results. Capacity: 30 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"30ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/rum_pl_Cos-De-BAHA-VM-Vitamin-C-MSM-Serum-Serum-cu-vitamina-C-si-MSM-30ml-16940_1-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/cos-de-baha-vitamin-c-facial-serum-with-msm-30ml\/"
  },
  {
    "product_name":"Anua – Heartleaf Silky Moisture Sun Cream SPF50+ PA++++, 50ml",
    "brand":"Anua",
    "category":"SPF Wholesale, Anua",
    "ingredients":"Anua – Heartleaf Silky Moisture Sun Cream SPF50+ PA++++ – 50 ml – a lightweight, hydrating sunscreen that protects the skin from harmful UV rays while calming and moisturizing it. Formulated with Heartleaf (Houttuynia Cordata) Extract and Centella Asiatica , it soothes irritation, balances oil and moisture, and prevents dryness. The silky, non-sticky texture absorbs quickly without leaving a white cast, providing a smooth, natural finish — ideal for daily use on all skin types, including sensitive and acne-prone skin. Product contains: Heartleaf (Houttuynia Cordata) Extract – calms redness and irritation while helping to purify and balance sensitive or acne-prone skin. Centella Asiatica Extract – promotes healing, strengthens the skin barrier, and soothes inflammation. Panthenol (Vitamin B5) – deeply hydrates and locks in moisture for long-lasting comfort. Niacinamide (Vitamin B3) – brightens dull skin, refines pores, and enhances overall skin tone. Hyaluronic Acid – delivers multi-layer hydration, keeping the skin soft, supple, and plump. Allantoin – soothes and protects the skin, ensuring a gentle finish suitable for sensitive types. Product effects: provides broad-spectrum protection (SPF50+ PA++++), hydrates and nourishes the skin without heaviness, calms irritation and strengthens the barrier, absorbs quickly with a silky, non-sticky finish, leaves skin smooth, radiant, and comfortably protected. Our cosmetologist recommends this product in case of: sensitive, oily, or acne-prone skin, redness, dryness, or irritation, need for lightweight daily UV protection, preference for non-greasy, no white-cast sunscreens. How to use: Apply a moderate amount evenly over the face and neck as the last step of your morning skincare routine. Reapply every 2–3 hours when exposed to sunlight for continuous protection. Capacity: 50 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"50ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/Anua-Heartleaf-Silky-Moisture-Sun-Cream-3.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-heartleaf-silky-moisture-sun-cream-spf50-pa-50ml\/"
  },
  {
    "product_name":"AXIS-Y – Biome Resetting Moringa Cleansing Oil, 200ml",
    "brand":"AXIS-Y",
    "category":"Cleanser Wholesale, AXIS-Y",
    "ingredients":"Axis-Y – Biome Resetting Moringa Cleansing Oil – 200 ml – a gentle, purifying cleansing oil designed to remove makeup, sunscreen, and impurities while maintaining a healthy skin barrier. Formulated with Moringa Oil and Biome Complex , it deeply cleanses pores, balances sebum, and nourishes the skin without clogging or irritation. The lightweight texture emulsifies easily, leaving the skin clean, soft, and refreshed — perfect for all skin types, including sensitive and acne-prone skin. Product contains: Moringa Oleifera Seed Oil – rich in antioxidants and fatty acids that dissolve impurities, unclog pores, and nourish the skin for a smooth, radiant complexion. Jojoba Seed Oil – mimics natural skin oils to regulate sebum production and maintain hydration. Sunflower Seed Oil – softens and smooths the skin while reinforcing the natural barrier. Centella Asiatica Extract – calms irritation, reduces redness, and supports healing. Green Tea Extract – provides antioxidant protection and helps purify the skin. Probiotics + Prebiotics (Biome Complex) – strengthen the skin’s microbiome and enhance overall resilience and balance. Product effects: removes makeup, sunscreen, and excess sebum, deeply cleanses pores without stripping moisture, nourishes and strengthens the skin barrier, calms irritation and balances oil levels, leaves skin soft, clean, and refreshed. Our cosmetologist recommends this product in case of: clogged pores or blackheads, dull, congested, or oily skin, dryness or sensitivity from harsh cleansers, need for a gentle daily cleansing oil that maintains barrier health. How to use: Pump 2–3 times into dry hands and gently massage onto dry face to dissolve makeup and impurities. Add a small amount of lukewarm water to emulsify the oil into a milky texture. Rinse thoroughly and follow with your regular cleanser if desired. Use daily as the first step of your skincare routine. Capacity: 200 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"200ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/Axis-Y-Biome-Resetting-Moringa-Cleansing-Oil-200ml-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/axis-y-gesicht-reinigung-biome-resetting-moringa-cleansing-oil-200-ml\/"
  },
  {
    "product_name":"Beauty of Joseon – Calming Serum Green Tea + Panthenol, 30ml",
    "brand":"Beauty of Joseon",
    "category":"Bulk Serums, Beauty of Joseon",
    "ingredients":"Beauty of Joseon – Calming Serum: Green Tea + Panthenol – 30ml – a soothing and hydrating serum designed to calm irritation, reduce redness, and strengthen the skin barrier. Enriched with Green Tea Extract and Panthenol , it delivers lightweight yet deep hydration while balancing oil and moisture levels. Perfect for sensitive, acne-prone, or easily irritated skin that needs gentle daily care. Product contains: Green Tea Extract (50%) – rich in antioxidants and polyphenols that calm inflammation, protect against environmental stress, and refresh the skin. Panthenol (Vitamin B5, 30%) – replenishes hydration, soothes irritation, and reinforces the skin barrier for long-lasting comfort. Centella Asiatica Extract – accelerates skin healing, reduces redness, and helps strengthen sensitive skin. Mugwort Extract (Artemisia Princeps) – detoxifies and purifies the skin while providing antibacterial and soothing effects. Hyaluronic Acid – delivers multi-layer hydration, keeping the skin plump and smooth. Allantoin – softens and protects, ensuring a calm, balanced complexion. Product effects: calms redness and irritation instantly, deeply hydrates and restores moisture balance, strengthens and protects the skin barrier, reduces sensitivity and inflammation, leaves skin soft, clear, and refreshed. Our cosmetologist recommends this product in case of: sensitive, acne-prone, or irritated skin, redness or inflammation, weakened skin barrier, need for gentle daily hydration and soothing care. How to use: After cleansing and toning, apply 2–3 drops evenly to the face and neck. Gently pat until fully absorbed. Follow with moisturizer and sunscreen (morning) or cream (evening). Capacity: 30 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"30ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/1751784245686a1b2b79f23.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/beauty-of-joseon-calming-serum-green-tea-panthenol-30-ml\/"
  },
  {
    "product_name":"ABIB – Airy Sunstick SPF50+ PA++++",
    "brand":"ABIB",
    "category":"SPF Wholesale, ABIB",
    "ingredients":"Abib – Airy Sunstick SPF50+ PA++++ – a feather-light, non-greasy sun protection stick designed for comfortable daily use. Formulated with SPF50+ PA++++ for maximum UVA\/UVB defense, this sunstick shields the skin from sun damage and photoaging while maintaining a smooth, matte finish. Its airy, silky texture glides effortlessly onto the skin without stickiness or white cast, making it perfect for reapplication anytime. Enriched with Centella Asiatica extract and ceramides , it soothes and protects even sensitive skin. Product contains: SPF50+ \/ PA++++ UV Filters – offer strong, broad-spectrum protection against UVA and UVB rays, preventing sunburn and skin aging. Centella Asiatica Extract – calms irritation, reduces redness, and supports the skin’s natural healing process. Ceramide NP – reinforces the skin barrier and prevents moisture loss during sun exposure. Aloe Vera Leaf Extract – soothes and hydrates the skin, providing comfort throughout the day. Hyaluronic Acid – delivers lightweight hydration and keeps the skin smooth and supple. Acacia Peptides – improve skin elasticity and protect from environmental stress. Product effects: provides high UV protection (SPF50+ PA++++), lightweight, airy finish with no stickiness or white cast, balances and soothes sensitive skin, strengthens the skin barrier, absorbs excess sebum for a soft matte look, ideal for quick and easy sun protection reapplication. Our cosmetologist recommends this product in case of: daily sun exposure and outdoor activities, oily, combination, or sensitive skin, need for invisible, non-sticky sun protection, makeup wearers seeking easy reapplication throughout the day. How to use: Apply evenly to the face and exposed areas as the final step of your morning skincare routine. Reapply every 2–3 hours or as needed during prolonged sun exposure. Can be applied over makeup without smudging or greasiness. Capacity: see packaging. Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"50ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/SB-A__Thumb_337754de-d25e-47b5-b3c9-d8e6a7eb9da8-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-tone-up-quick-smoothing-sunstick-bar-spf50-pa\/"
  },
  {
    "product_name":"Anua – Heartleaf 80% Soothing Ampoule, 30ml",
    "brand":"Anua",
    "category":"Bulk Serums, Anua",
    "ingredients":"Anua – Heartleaf 80% Soothing Ampoule – 30 ml – a calming, hydrating serum formulated with 80% Heartleaf (Houttuynia Cordata) Extract to soothe irritation, reduce redness, and balance the skin. This lightweight ampoule absorbs quickly, delivering concentrated moisture and comfort without stickiness. Ideal for sensitive, acne-prone, or easily irritated skin, it helps restore balance and leaves the complexion calm, clear, and refreshed. Product contains: Heartleaf (Houttuynia Cordata) Extract (80%) – calms inflammation, purifies the skin, and controls excess sebum for a clear, balanced complexion. Centella Asiatica Extract – promotes healing and strengthens the skin barrier while reducing sensitivity. Panthenol (Vitamin B5) – soothes and hydrates the skin while preventing moisture loss. Allantoin – comforts and softens the skin, enhancing smoothness and calmness. Hyaluronic Acid – provides deep, long-lasting hydration, keeping the skin plump and supple. Product effects: soothes redness and irritation, balances oil and moisture levels, strengthens and protects the skin barrier, hydrates and refines skin texture, leaves skin calm, smooth, and refreshed. Our cosmetologist recommends this product in case of: sensitive, irritated, or acne-prone skin, redness or inflammation, dryness or imbalance caused by treatments or stress, need for daily soothing and barrier-repair care. How to use: After cleansing and toning, apply an appropriate amount to the face and neck. Gently pat until fully absorbed. Follow with moisturizer or cream to seal in hydration. Capacity: 30 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"30ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/anua-us-ampoule-serum-30ml-heartleaf-80-moisture-soothing-ampoule-1161173078-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-heartleaf-80-soothing-ampoule-30ml\/"
  },
  {
    "product_name":"ABIB – Heartleaf Creme Calming Tube, 75ml",
    "brand":"ABIB",
    "category":"Bulk Moisturizer, ABIB",
    "ingredients":"Abib – Heartleaf Crème Calming Tube – 75 ml – a gentle, soothing cream formulated to calm irritation, deeply hydrate, and strengthen the skin barrier. Enriched with Heartleaf (Houttuynia Cordata) extract and Centella Asiatica , this cream helps reduce redness, balance moisture and oil levels, and protect the skin from external stressors. Its soft, non-sticky texture absorbs quickly, leaving the skin smooth, refreshed, and comfortably calm — ideal for sensitive, irritated, or acne-prone skin. Product contains: Heartleaf (Houttuynia Cordata) Extract – provides anti-inflammatory and antibacterial benefits, soothing redness and irritation while helping to regulate sebum production. Centella Asiatica Extract – promotes skin healing, strengthens the barrier, and calms inflammation. Panthenol (Vitamin B5) – hydrates, softens, and soothes the skin, maintaining long-lasting comfort. Allantoin – protects sensitive skin, smooths texture, and supports regeneration. Hyaluronic Acid – delivers intense hydration, keeping the skin plump and moisturized throughout the day. Madecassoside – restores damaged skin, enhances elasticity, and reduces sensitivity. Niacinamide (Vitamin B3) – brightens dull skin, refines pores, and reinforces the protective barrier. Product effects: soothes irritation and reduces redness, hydrates deeply and maintains moisture balance, strengthens the skin’s natural barrier, improves texture and elasticity, helps prevent dryness and roughness, leaves the skin soft, calm, and healthy-looking. Our cosmetologist recommends this product in case of: sensitive or irritated skin, redness, dryness, or inflammation, weakened barrier after treatments or stress, need for gentle daily soothing care. How to use: Apply a moderate amount to cleansed and toned skin. Gently spread over the face and neck until fully absorbed. Use morning and evening as the last step of your skincare routine. Capacity: 75 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"75ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/ABIB-Heartleaf-Creme-Calming-Tube-75ml-PURESEOUL-UK-KBeauty-Shop-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-heartleaf-creme-calming-tube-75ml\/"
  },
  {
    "product_name":"COSRX – Advanced Snail Radiance Dual Essence, 80ml",
    "brand":"COSRX",
    "category":"Bulk Serums, COSRX",
    "ingredients":"COSRX – Advanced Snail Radiance Dual Essence – 80 ml – a dual-chamber essence combining intensive hydration and brightening for visibly smoother, plumper and more radiant skin. Ideal for treating dullness, rough texture, early signs of aging and skin needing both barrier support and luminosity. Product contains: Triple Snail Complex (74.3%) – a blend of snail secretion filtrates that deeply hydrate, regenerate, improve elasticity and refine texture. Niacinamide (5%) – brightens uneven skin tone, strengthens the skin barrier and enhances overall clarity. Glutathione – an antioxidant that supports improved skin tone and reduces the appearance of dullness. Panthenol (Vitamin B5), Betaine & Sodium Hyaluronate – soothe, hydrate and lock in moisture for a soft, comfortable finish. Botanical Seed Oils (Meadowfoam, Sunflower, Macadamia) & Allantoin – nourish, soften and reinforce skin resilience. Product effects: deeply hydrates and plumps the skin, brightens dull, uneven complexion and fades early signs of discoloration, improves texture and smooths roughness or fine lines, strengthens the barrier and reduces sensitivity, leaves skin visibly smoother, radiant and revitalised. Recommended for: skin that appears dull, fatigued or has lost its glow, rough texture, visible fine lines or enlarged pores, skin needing both hydrating and brightening care without heaviness, users who want a high-performance essence suitable for layering under moisturiser. How to use: After cleansing and toning, pump an appropriate amount of the dual essence (one pump blends both chambers). Apply evenly to the face and neck and gently pat until fully absorbed. Follow with your serum and moisturizer. Use morning and\/or evening according to your skincare routine. Capacity: 80 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"80ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/COSRX-Advanced-Snail-Radiance-Dual-Essence-8809598455818-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/cosrx-advanced-snail-radiance-dual-essence-80-ml\/"
  },
  {
    "product_name":"Anua – Peach 77% Niacin Essence Toner, 250ml",
    "brand":"Anua",
    "category":"Bulk Toners, Anua",
    "ingredients":"Anua – Peach 77% Niacin Essence Toner – 250 ml – a brightening and hydrating toner formulated with 77% Peach Extract and Niacinamide to revitalize dull skin, smooth texture, and enhance natural radiance. The lightweight essence-type formula absorbs quickly, delivering a refreshing boost of moisture and nutrients that leave the skin soft, plump, and glowing. Perfect for daily use, it helps improve elasticity and overall skin clarity while maintaining a healthy, luminous complexion. Product contains: Peach Extract (77%) – rich in vitamins and antioxidants that brighten dull skin, refine texture, and provide lasting hydration. Niacinamide (Vitamin B3) – improves uneven skin tone, refines pores, and strengthens the skin barrier for a smooth, radiant finish. Hyaluronic Acid – delivers deep moisture to keep the skin hydrated, supple, and fresh. Panthenol (Vitamin B5) – soothes, softens, and supports long-lasting hydration. Allantoin – calms and protects sensitive skin while promoting smoothness. Centella Asiatica Extract – reduces redness and irritation, supporting barrier health. Product effects: brightens and evens out skin tone, hydrates and replenishes moisture, smooths texture and refines pores, enhances radiance and elasticity, leaves skin soft, fresh, and luminous. Our cosmetologist recommends this product in case of: dull, uneven, or dehydrated skin, tired or lackluster complexion, sensitivity or weakened skin barrier, need for gentle daily brightening and moisturizing care. How to use: After cleansing, pour an appropriate amount onto a cotton pad or palms. Gently sweep or pat over the face and neck until fully absorbed. Follow with serum and moisturizer for best results. Capacity: 250 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"250ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/Anua-Peach-77-Niacin-Essence-Toner.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-peach-77-niacin-essence-toner-250ml\/"
  },
  {
    "product_name":"COSRX – Advanced Snail Mucin Power Sheet Mask, 25ml",
    "brand":"COSRX",
    "category":"Face Masks Wholesale, Under €5, COSRX",
    "ingredients":"COSRX – Advanced Snail Mucin Power Sheet Mask – 25 ml – a deeply hydrating and repairing sheet mask infused with snail mucin to restore moisture, improve skin elasticity, and soothe irritation for a smooth, radiant, and revitalised complexion. Product contains: Snail Secretion Filtrate (Snail Mucin) – highly regenerative and hydrating ingredient that supports skin repair, improves texture, and boosts elasticity for a healthier, plumper look. Sodium Hyaluronate – a moisture-binding humectant that delivers deep hydration and helps maintain a soft, supple complexion. Panthenol (Vitamin B5) – soothes and calms the skin while reinforcing the moisture barrier. Allantoin – helps comfort irritated skin and supports a smoother, more even-toned appearance. Hydrating and skin-repairing agents – provide nourishment and enhance the overall resilience of the skin. Product effects: delivers intense hydration and replenishes moisture levels, supports skin repair and improves elasticity, soothes irritation, redness, and sensitivity, leaves skin soft, plump, and radiant, helps refine texture for a smoother, healthier-looking complexion. Recommended for: dry, dehydrated, or dull skin needing a hydration boost, irritated or stressed skin requiring soothing and repair, those looking to improve plumpness and overall radiance, all skin types, especially sensitive or moisture-depleted skin. How to use: Apply the sheet mask onto clean, toned skin. Leave on for 10–20 minutes, then remove and gently pat the remaining essence until absorbed. Follow with moisturizer to seal in hydration. Use whenever your skin needs an extra boost of moisture and repair. Capacity: 25 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"25ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/cosrx-advanced-snail-mucin-power-sheet-mask-8809598452442-888280-600x750.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/advanced-snail-mucin-power-sheet-mask-25ml\/"
  },
  {
    "product_name":"Beauty of Joseon – Ground Rice and Honey Glow Mask, 150ml",
    "brand":"Beauty of Joseon",
    "category":"Face Masks Wholesale, Beauty of Joseon",
    "ingredients":"Beauty of Joseon – Ground Rice and Honey Glow Mask – 150 ml – a nourishing, brightening wash-off mask infused with Rice Bran and Honey Extract to smooth texture, hydrate deeply, and enhance natural radiance. This creamy, gentle formula removes impurities and dead skin cells while restoring glow and softness, leaving the complexion refined, moisturized, and luminous. Perfect for dry, dull, or uneven skin needing a revitalizing boost. Product contains: Rice Bran & Ground Rice Powder – gently exfoliate dead skin cells, brighten dull areas, and refine skin texture for a smooth finish. Honey Extract – deeply nourishes and hydrates, improving elasticity and adding a healthy glow. Ginseng Root Extract – revitalizes and energizes the skin while helping to improve tone and resilience. Propolis Extract – provides antibacterial and anti-inflammatory benefits while strengthening the skin barrier. Centella Asiatica Extract – soothes irritation and promotes healing for a calm, balanced complexion. Panthenol (Vitamin B5) – hydrates and protects against moisture loss, enhancing skin softness. Product effects: gently exfoliates and smooths rough texture, brightens and evens out dull skin tone, nourishes and hydrates deeply, restores elasticity and healthy radiance, leaves skin soft, refreshed, and glowing. Our cosmetologist recommends this product in case of: dull, rough, or uneven skin texture, dryness and lack of radiance, sensitivity to harsh exfoliants, need for gentle exfoliating and brightening care. How to use: After cleansing, apply an even layer to clean, dry skin, avoiding the eye and lip areas. Leave on for 10–15 minutes, then gently rinse off with lukewarm water. Use 2–3 times per week for a soft, radiant complexion. Capacity: 150 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"150ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/Beauty-of-Joseon-Ground-Rice-and-Honey-Glow-Mask-150ml--600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/beauty-of-joseon-ground-rice-and-honey-glow-mask-150ml\/"
  },
  {
    "product_name":"Anua – Birch 70 Moisture Boosting Serum, 30ml",
    "brand":"Anua",
    "category":"Bulk Serums, Anua",
    "ingredients":"Anua – Birch 70 Moisture Boosting Serum – 30 ml – a lightweight, deeply hydrating serum infused with 70% Birch Sap to replenish moisture, strengthen the skin barrier, and restore natural radiance. Formulated with Hyaluronic Acid and Panthenol , it delivers long-lasting hydration and soothes irritation while leaving the skin smooth, plump, and refreshed. Ideal for dry, sensitive, or dehydrated skin needing gentle yet intensive moisture care. Product contains: Birch Sap (70%) – rich in amino acids, minerals, and antioxidants that hydrate and revitalize the skin while improving texture and elasticity. Hyaluronic Acid – provides multi-layer hydration to keep the skin soft, supple, and plump. Panthenol (Vitamin B5) – soothes and strengthens the skin barrier, reducing dryness and irritation. Allantoin – calms and softens the skin, enhancing comfort and smoothness. Centella Asiatica Extract – soothes sensitive or stressed skin and supports barrier recovery. Product effects: delivers deep hydration and lasting moisture, soothes irritation and strengthens the barrier, improves elasticity and skin smoothness, leaves skin plump, soft, and luminous, provides refreshing comfort without stickiness. Our cosmetologist recommends this product in case of: dry, dehydrated, or sensitive skin, weakened or damaged barrier, dull or tired complexion, need for lightweight daily hydration care. How to use: After cleansing and toning, apply an appropriate amount to the face and neck. Gently pat until fully absorbed. Follow with moisturizer or cream to lock in hydration. Capacity: 30 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"30ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/41pOWQSEMYL-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-birch-70-moisture-boosting-serum-30ml\/"
  },
  {
    "product_name":"AXIS-Y – Biome Ultimate Indulging Cream, 55ml\/1.85oz",
    "brand":"AXIS-Y",
    "category":"Bulk Moisturizer, AXIS-Y",
    "ingredients":"Axis-Y – Biome Ultimate Indulging Cream – 55 ml \/ 1.85 oz – a luxurious, barrier-strengthening moisturizer formulated with Biome Blend and Probiotics to deeply nourish, soothe, and restore balance to the skin. Designed to support a healthy microbiome, this rich yet lightweight cream locks in moisture while protecting against environmental stressors. It leaves the skin soft, smooth, and resilient — ideal for dry, sensitive, or compromised skin in need of repair and renewal. Product contains: Biome Blend (Probiotics + Prebiotics Complex) – strengthens the skin barrier, supports the natural microbiome, and enhances resistance to external irritation. Centella Asiatica Extract – calms redness, promotes healing, and soothes sensitive skin. Ceramides – reinforce the moisture barrier, preventing water loss and improving elasticity. Niacinamide (Vitamin B3) – brightens dull skin, refines pores, and boosts barrier function for an even complexion. Hyaluronic Acid – provides deep, long-lasting hydration for plump, supple skin. Squalane – mimics natural skin oils to nourish and smooth without greasiness. Adenosine – reduces fine lines and promotes firmness and elasticity. Product effects: deeply moisturizes and locks in hydration, strengthens and protects the skin barrier, calms irritation and supports healing, improves texture and radiance, leaves skin soft, firm, and healthy-looking. Our cosmetologist recommends this product in case of: dry, sensitive, or dehydrated skin, weakened skin barrier or irritation, dull, rough texture or uneven tone, need for intensive barrier repair and nourishment. How to use: After applying toner and serum, take an appropriate amount and spread evenly over the face and neck. Gently massage until fully absorbed. Use morning and evening for optimal results. Capacity: 55 ml \/ 1.85 oz Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"55ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/2_71c67d12-c9ee-4de3-87d7-949fc4acaec2-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/axis-y-biome-ultimate-indulging-cream-55ml-1-85oz\/"
  },
  {
    "product_name":"Anua – Heartleaf 77% Clear Toner Pads – 160ml",
    "brand":"Anua",
    "category":"Bulk Exfoliants, Cleanser Wholesale, Anua",
    "ingredients":"Anua – Heartleaf 77% Clear Toner Pads – 160 ml – soothing and clarifying toner pads infused with 77% Heartleaf (Houttuynia Cordata) Extract to calm irritation, balance oil production, and refine pores. The dual-sided pads feature a textured side for gentle exfoliation and a smooth side for hydration, leaving the skin clean, refreshed, and visibly smoother. Perfect for daily use, especially for sensitive, oily, or acne-prone skin in need of gentle exfoliation and calming care. Product contains: Heartleaf (Houttuynia Cordata) Extract (77%) – calms redness and irritation, purifies pores, and helps control excess sebum. Centella Asiatica Extract – promotes healing and strengthens the skin barrier while soothing sensitivity. Panthenol (Vitamin B5) – hydrates and replenishes the skin, maintaining softness and comfort. Allantoin – soothes and smooths the skin while reducing irritation. Hyaluronic Acid – delivers deep moisture, keeping the skin hydrated and plump after cleansing. Product effects: gently exfoliates and removes dead skin cells, refines pores and balances oil–moisture levels, soothes irritation and calms redness, provides hydration and strengthens the skin barrier, leaves skin soft, smooth, and refreshed. Our cosmetologist recommends this product in case of: sensitive, oily, or acne-prone skin, redness or irritation from environmental stress, clogged pores or rough texture, need for quick, gentle toning and soothing care. How to use: After cleansing, take one pad and gently wipe the face using the embossed side to exfoliate and remove impurities. Flip the pad and use the smooth side to pat remaining essence into the skin. Can be used daily, morning or evening. Close the lid tightly after each use to prevent drying. Capacity: 160 ml (70 pads) Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"160ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/ANUA_Heartleaf_77_Clear_Pad_grande.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-heartleaf-77-clear-toner-pads-160ml\/"
  },
  {
    "product_name":"ABIB – Glutathiosome Dark Spot Serum Vita Drop, 50ml",
    "brand":"ABIB",
    "category":"Bulk Serums, ABIB",
    "ingredients":"Abib – Glutathiosome Dark Spot Serum Vita Drop – an intensive brightening serum formulated to reduce the appearance of dark spots, pigmentation, and uneven tone. Infused with glutathione , vitamin complex , and niacinamide , it works to illuminate dull skin, even out discoloration, and restore radiance. Its lightweight, hydrating texture absorbs easily without stickiness, leaving the skin clear, luminous, and full of vitality. Product contains: Glutathione – a powerful antioxidant that brightens the skin, reduces pigmentation, and protects against free radical damage. Niacinamide (Vitamin B3) – visibly brightens the complexion, refines pores, and strengthens the skin barrier. Vitamin Complex (B5, C, E) – revitalizes and nourishes the skin while improving clarity and resilience. Alpha-Arbutin – helps fade dark spots and discoloration for a more even skin tone. Adenosine – supports skin elasticity and smoothness, providing anti-aging benefits. Hyaluronic Acid – delivers deep, lasting hydration and keeps the skin plump. Panthenol (Vitamin B5) – soothes irritation and maintains healthy moisture balance. Product effects: brightens dull and uneven skin tone, helps fade dark spots and pigmentation, improves radiance and clarity, strengthens the skin barrier and smooths texture, provides antioxidant protection, leaves the skin luminous, hydrated, and refreshed. Our cosmetologist recommends this product in case of: dark spots, acne marks, or uneven pigmentation, dull and tired-looking skin, early signs of aging or discoloration, anyone seeking a brighter, more radiant complexion. How to use: After cleansing and toning, apply an appropriate amount to the face and gently pat for absorption. Follow with your moisturizer or cream. Use morning and evening for best results. During the day, always apply sunscreen after use to protect skin brightness. Capacity: 50 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"50ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/thumb_VD-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-glutathiosome-dark-spot-serum-vita-drop-50ml\/"
  },
  {
    "product_name":"Anua – Birch 70 Moisture Boosting Toner, 250ml",
    "brand":"Anua",
    "category":"Bulk Toners, Anua",
    "ingredients":"Anua – Birch 70 Moisture Boosting Toner – 250 ml – a refreshing, deeply hydrating toner enriched with 70% Birch Sap to restore moisture, calm sensitivity, and strengthen the skin barrier. The lightweight, watery texture absorbs quickly, delivering a cooling sensation and leaving the skin soft, smooth, and plump. Perfect for dry, dehydrated, or sensitive skin, it helps rebalance and revitalize the complexion for a fresh, healthy glow. Product contains: Birch Sap (70%) – packed with amino acids, minerals, and antioxidants that hydrate, soothe, and revitalize tired or dry skin. Hyaluronic Acid – provides multi-level hydration, keeping the skin supple and dewy. Panthenol (Vitamin B5) – strengthens the moisture barrier and reduces irritation. Allantoin – softens, smooths, and protects the skin from dryness. Centella Asiatica Extract – soothes inflammation and enhances resilience for sensitive skin. Product effects: deeply hydrates and restores skin moisture balance, strengthens and protects the skin barrier, calms irritation and refreshes the skin, improves texture and elasticity, leaves the skin soft, plump, and radiant. Our cosmetologist recommends this product in case of: dry, sensitive, or dehydrated skin, irritation or redness due to dryness, dull, tired complexion, need for gentle, everyday hydration care. How to use: After cleansing, apply an appropriate amount to a cotton pad or directly with your hands. Gently pat onto the face and neck until absorbed. Use morning and evening before serum or moisturizer. Capacity: 250 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"250ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/Anua-Birch-70-Moisture-Boosting-Toner.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-birch-70-moisture-boosting-toner-250ml\/"
  },
  {
    "product_name":"AXIS-Y – Quinoa One Step Balanced Gel Cleanser, 180ml",
    "brand":"AXIS-Y",
    "category":"Cleanser Wholesale, AXIS-Y",
    "ingredients":"to remove makeup, sunscreen, and impurities while maintaining the skin",
    "size_packaging":"180ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/buy-axis-y-quinoa-one-step-balanced-gel-cleanser-180ml-at-lila-beauty-korean-and-japanese-beauty-skin-care-810850.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/axis-y-quinoa-one-step-balanced-gel-cleanser-180ml\/"
  },
  {
    "product_name":"ABIB – Rice Probiotics Overnight Mask Barrier Jelly, 80ml",
    "brand":"ABIB",
    "category":"Face Masks Wholesale, ABIB",
    "ingredients":"Abib – Rice Probiotics Overnight Mask Barrier Jelly – a rich, jelly-textured sleeping mask formulated with rice bran extract and probiotic complex to restore the skin barrier, boost hydration, and improve elasticity while you sleep. This deeply nourishing mask strengthens the skin’s natural defenses, replenishes moisture, and helps achieve a smooth, luminous complexion by morning. Perfect for dry, sensitive, or fatigued skin in need of overnight recovery. Product contains: Rice Bran Extract – rich in amino acids and vitamins, it nourishes, softens, and brightens the skin while improving elasticity. Probiotic Complex (Lactobacillus Ferment, Bifida Ferment Lysate) – strengthens the skin barrier, balances the microbiome, and enhances resistance to external stressors. Niacinamide (Vitamin B3) – brightens dull skin, refines pores, and improves uneven tone. Adenosine – smooths fine lines and supports elasticity for firmer-looking skin. Panthenol (Vitamin B5) – deeply hydrates and soothes irritation, promoting a healthy barrier. Hyaluronic Acid – locks in moisture and maintains skin suppleness throughout the night. Allantoin – calms and protects sensitive skin, reducing dryness and discomfort. Product effects: strengthens and repairs the skin barrier, provides deep overnight hydration, smooths texture and enhances elasticity, brightens and revitalizes dull, tired skin, reduces dryness and sensitivity, leaves skin soft, plump, and glowing by morning. Our cosmetologist recommends this product in case of: dry, sensitive, or weakened skin barrier, dull and fatigued complexion, dehydration or rough texture, need for intensive overnight skin recovery. How to use: As the last step of your evening skincare routine, apply a moderate amount evenly over the face, avoiding the eye and lip area. Leave on overnight and rinse off with lukewarm water in the morning. Use 2–3 times per week , or daily if extra nourishment is needed. Capacity: 80 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"80ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/Abib-Rice-Probiotics-Overnight-Mask-Barrier-Jelly-80ml-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-rice-probiotics-overnight-mask-barrier-jelly-80ml\/"
  },
  {
    "product_name":"Anua – Heartleaf 70% Daily Lotion, 200ml",
    "brand":"Anua",
    "category":"Bulk Moisturizer, Anua",
    "ingredients":"Anua – Heartleaf 70% Daily Lotion – 200 ml – a lightweight, soothing moisturizer infused with 70% Heartleaf (Houttuynia Cordata) Extract to calm irritation, balance oil and moisture, and strengthen the skin barrier. This refreshing lotion absorbs quickly without greasiness, providing lasting hydration and comfort while leaving the skin smooth, soft, and clear. Ideal for sensitive, oily, or combination skin, it helps maintain a calm and balanced complexion all day long. Product contains: Heartleaf (Houttuynia Cordata) Extract (70%) – calms irritation, controls excess sebum, and purifies the skin to prevent breakouts. Centella Asiatica Extract – promotes healing and supports barrier recovery, ideal for stressed or reactive skin. Panthenol (Vitamin B5) – deeply hydrates and soothes, improving skin elasticity and smoothness. Allantoin – softens, protects, and provides comfort to sensitive or dry skin. Hyaluronic Acid – delivers multi-layer hydration for long-lasting moisture and suppleness. Product effects: balances sebum and moisture levels, calms redness and irritation, hydrates without clogging pores, strengthens and repairs the skin barrier, leaves skin fresh, soft, and healthy-looking. Our cosmetologist recommends this product in case of: oily, combination, or acne-prone skin, redness or sensitivity, dull or rough texture, need for lightweight daily hydration and soothing care. How to use: After cleansing and toning, apply an appropriate amount evenly over the face and neck. Gently pat until fully absorbed. Use morning and evening as part of your daily skincare routine. Capacity: 200 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"200ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/Anua-Heartleaf-70-Daily-Lotion-1-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-heartleaf-70-daily-lotion-200ml\/"
  },
  {
    "product_name":"ABIB – Gummy Sheet Mask Madecassoside Sticker, 27ml",
    "brand":"ABIB",
    "category":"Face Masks Wholesale, Under €5, ABIB",
    "ingredients":"Abib – Gummy Sheet Mask Madecassoside Sticker – a calming and restorative sheet mask infused with madecassoside and Centella Asiatica extract to soothe irritation, strengthen the skin barrier, and promote healing. The “gummy sticker” sheet adheres perfectly to the skin for maximum absorption of the essence, delivering intensive care to sensitive, stressed, or acne-prone skin. It helps reduce redness, replenish moisture, and restore balance for a clear, healthy-looking complexion. Product contains: Madecassoside – a powerful soothing ingredient derived from Centella Asiatica; calms inflammation, promotes healing, and strengthens the skin barrier. Centella Asiatica Extract – relieves irritation and redness while supporting regeneration of damaged skin. Panthenol (Vitamin B5) – hydrates, soothes, and improves skin elasticity. Allantoin – softens and protects the skin while reducing sensitivity. Hyaluronic Acid – provides long-lasting hydration and plumps the skin. Niacinamide (Vitamin B3) – balances sebum, refines pores, and improves uneven tone. Adenosine – supports anti-aging care by smoothing fine lines and improving elasticity. Product effects: calms and soothes irritated or sensitive skin, reduces redness and inflammation, strengthens the skin’s natural barrier, replenishes hydration and improves texture, supports regeneration and healing, leaves skin soft, smooth, and refreshed. Our cosmetologist recommends this product in case of: sensitive or acne-prone skin, redness, dryness, or post-acne marks, irritation caused by external factors (sun, pollution, treatments), weakened or damaged skin barrier. How to use: After cleansing and toning, apply the mask evenly over the face, aligning with the eyes and mouth. Leave on for 10–20 minutes to allow the essence to absorb fully. Remove the mask and gently pat the remaining serum into the skin until absorbed. Follow with your cream or moisturizer if desired. Capacity: 27 ml (1 sheet) Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"27ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/abib-gummy-sheet-mask-madecassoside-sticker-1pc-29-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-gummy-sheet-mask-madecassoside-sticker-27ml\/"
  },
  {
    "product_name":"Dr. Althea – Marine Anti-Blemish Sheet Mask, 1 pc x 27g",
    "brand":"Dr. Althea",
    "category":"Face Masks Wholesale, Dr. Althea",
    "ingredients":"Dr. Althea – Marine Anti-Blemish Sheet Mask – 27 g (1 pc) – a clarifying, soothing sheet mask infused with marine extracts to calm blemishes, refine pores, and restore balance to troubled or oily skin. Designed to reduce redness and excess sebum while delivering refreshing hydration, it leaves the complexion clearer, smoother, and more refined. Product contains: Marine Extract Complex – rich in minerals to purify, soothe inflammation, and help balance excess oil. Tea Tree Extract – targets blemishes, reduces bacteria, and calms active breakouts. Niacinamide – brightens uneven tone, refines pores, and supports a clearer complexion. Hyaluronic Acid – provides lightweight hydration to maintain moisture without clogging pores. Soothing Botanical Ingredients – help reduce redness and irritation while supporting skin recovery. Product effects: helps reduce blemishes and active breakouts, controls excess sebum and minimizes the appearance of pores, soothes redness and irritation for calmer skin, hydrates without heaviness, maintaining moisture balance, leaves the skin clearer, smoother, and more refreshed. Recommended for: oily, combination, and blemish-prone skin, redness, irritation, or active breakouts, enlarged pores or excess sebum, all skin types needing a clarifying, soothing sheet mask. How to use: Apply the sheet mask onto clean, toned skin. Leave on for 15–20 minutes, then remove and gently pat the remaining essence until fully absorbed. Follow with moisturizer to lock in hydration. Capacity: 27 g (1 mask) Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"27g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/draltheamarinemask-min_1000x-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/marine-anti-blemish-sheet-mask-1-pc-x-27g\/"
  },
  {
    "product_name":"AXIS-Y – Vegan Collagen Eye Serum, 10ml",
    "brand":"AXIS-Y",
    "category":"Eye Cream Wholesale, AXIS-Y",
    "ingredients":"Axis-Y – Vegan Collagen Eye Serum – 10 ml – a firming and brightening eye serum formulated with Vegan Collagen and Niacinamide to smooth fine lines, hydrate deeply, and reduce the appearance of dark circles. Its lightweight gel texture absorbs quickly without stickiness, instantly refreshing tired eyes and improving elasticity over time. Perfect for all skin types, especially those seeking gentle yet effective eye care. Product contains: Vegan Collagen – enhances elasticity, firms the skin, and minimizes fine lines and wrinkles. Niacinamide (Vitamin B3) – brightens dull under-eyes, evens out tone, and strengthens the skin barrier. Panthenol (Vitamin B5) – hydrates and soothes, maintaining smoothness and comfort. Adenosine – improves firmness and reduces the appearance of fine lines and wrinkles. Hyaluronic Acid – provides multi-layer hydration to plump and refresh the delicate eye area. Green Tea Extract – offers antioxidant protection and soothes puffiness and irritation. Product effects: smooths fine lines and improves firmness, brightens and refreshes dull under-eyes, reduces puffiness and dark circles, hydrates and plumps without heaviness, leaves the eye area radiant and rejuvenated. Our cosmetologist recommends this product in case of: visible fine lines or wrinkles around the eyes, dark circles or tired appearance, dryness or loss of elasticity, need for daily gentle firming and brightening care. How to use: After cleansing and toning, apply a small amount to the eye area using your ring finger. Gently tap until fully absorbed. Use morning and evening for best results. Capacity: 10 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"10ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/res_724db353726eb02b961e903beedeecc9-copy-600x600.png",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/axis-y-vegan-collagen-eye-serum-10ml\/"
  },
  {
    "product_name":"Beauty of Joseon – Glow Serum : Proplis + Niacinamide, 30ml",
    "brand":"Beauty of Joseon",
    "category":"Bulk Serums, Beauty of Joseon",
    "ingredients":"Beauty of Joseon – Glow Serum: Propolis + Niacinamide – 30 ml – a brightening and soothing serum formulated with Propolis Extract and Niacinamide to balance, nourish, and enhance the skin’s natural glow. Its lightweight, honey-like texture absorbs effortlessly, delivering moisture and radiance while refining texture and reducing blemishes. Ideal for dull, dehydrated, or acne-prone skin needing calming care and luminosity. Product contains: Propolis Extract (60%) – rich in antioxidants and anti-inflammatory compounds that calm irritation, repair damaged skin, and restore vitality. Niacinamide (Vitamin B3) – brightens dull tone, improves elasticity, and strengthens the skin barrier. Turmeric Root Extract – provides antioxidant benefits, helping to fade dark spots and even out the complexion. Tea Tree Extract – purifies pores, controls excess sebum, and soothes acne-prone skin. Panthenol (Vitamin B5) – hydrates and protects the skin from dryness and irritation. Royal Jelly Extract – nourishes deeply and enhances the skin’s glow and smoothness. Product effects: brightens dull and uneven skin tone, soothes inflammation and irritation, refines texture and minimizes blemishes, balances oil and moisture levels, leaves skin radiant, soft, and dewy. Our cosmetologist recommends this product in case of: dull or uneven skin tone, redness, irritation, or breakouts, dryness or loss of radiance, need for gentle daily glow-boosting care. How to use: After cleansing and toning, apply 2–3 drops evenly to the face and neck. Gently pat until fully absorbed. Follow with moisturizer or cream. Use morning and evening for optimal results. Capacity: 30 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"30ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/6000206468392-600x600.avif",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/beauty-of-joseon-glow-serum-proplis-niacinamide-30ml\/"
  },
  {
    "product_name":"Beauty of Joseon – Red Bean Water Gel, 100ml",
    "brand":"Beauty of Joseon",
    "category":"Bulk Exfoliants, Cleanser Wholesale, Beauty of Joseon",
    "ingredients":"Beauty of Joseon – Red Bean Water Gel – 100ml – a lightweight, refreshing gel moisturizer formulated with Red Bean Extract and Peptides to hydrate, balance, and refine oily or combination skin. This water-based gel absorbs quickly without stickiness, controlling excess sebum while maintaining smooth, supple hydration. Ideal for those who prefer a non-greasy finish and a cooling, refreshing texture. Product contains: Red Bean Extract (Haenam Red Bean 44%) – rich in antioxidants and saponins that help absorb excess sebum, refine pores, and promote smooth, clear skin. Peptide Complex – supports collagen production, improves elasticity, and enhances skin firmness. Niacinamide (Vitamin B3) – brightens dull tone, refines texture, and strengthens the skin barrier. Panthenol (Vitamin B5) – hydrates deeply while calming irritation and protecting against dryness. Hyaluronic Acid – locks in moisture for long-lasting hydration and a plump, soft appearance. Allantoin – soothes and smooths the skin, ensuring comfort and balance. Product effects: hydrates and refreshes the skin without heaviness, controls excess oil and refines pores, improves elasticity and smoothness, brightens and evens out tone, leaves skin soft, balanced, and radiant. Our cosmetologist recommends this product in case of: oily, combination, or acne-prone skin, visible pores or excess sebum, dull, tired, or rough skin texture, need for lightweight daily hydration with a cooling effect. How to use: After cleansing, toning, and applying serum, apply an appropriate amount evenly to the face and neck. Gently pat until fully absorbed. Use morning and evening. Can also be used as an oil-controlling makeup base in the daytime. Capacity: 100 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"100ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/K-Beauty-of-Joseon-Red-Bean-Water-Gel-100ml-mit-EAN-8809738316993-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/beauty-of-joseon-red-bean-water-gel-100-ml\/"
  },
  {
    "product_name":"d’Alba – White Truffle Vital Spray Serum, 100ml",
    "brand":"d'Alba",
    "category":"Bulk Serums, d'Alba",
    "ingredients":"d’Alba – White Truffle Vital Spray Serum – 100 ml – a revitalizing, dual-layer mist serum infused with premium white truffle and nourishing botanical oils to boost radiance, hydrate deeply, and restore vitality to tired or dull-looking skin. Its fine spray delivers instant moisture and glow for refreshed, dewy skin anytime. Product contains: White Truffle Extract – rich in antioxidants and essential nutrients that help rejuvenate the skin, improve elasticity, and promote a healthy, radiant appearance. Botanical Oils (e.g., Avocado Oil, Sunflower Seed Oil) – nourish and soften the skin while providing a natural glow without heaviness. Niacinamide – brightens uneven tone, improves texture, and strengthens the skin barrier. Hyaluronic Acid Complex – delivers multi-layer hydration, keeping the skin plump, smooth, and refreshed. Soothing Agents (e.g., Panthenol, Centella Asiatica Extract) – calm irritation and support skin comfort throughout the day. Product effects: instantly hydrates and refreshes dull or tired skin, enhances radiance and provides a healthy, dewy glow, nourishes deeply while improving elasticity, soothes and calms sensitive or stressed skin, absorbs quickly without leaving a greasy residue. Recommended for: dull, dehydrated, or fatigued skin needing instant radiance, uneven tone or loss of vitality, sensitive or irritated skin requiring soothing hydration, all skin types seeking an on-the-go glow-boosting mist. How to use: Shake well to mix the dual layers. Close your eyes and spray evenly across the face from a slight distance. Gently pat to enhance absorption if desired. Use after cleansing, before makeup, or anytime your skin needs a hydration boost. Capacity: 100 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"100ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/8809563064823-1.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/dalba-white-truffle-vital-spray-serum-100ml\/"
  },
  {
    "product_name":"Beauty of Joseon – Radiance Cleansing Balm, 100ml",
    "brand":"Beauty of Joseon",
    "category":"Cleanser Wholesale, Beauty of Joseon",
    "ingredients":"Beauty of Joseon – Radiance Cleansing Balm – 100ml – a gentle, nourishing cleansing balm that melts away makeup, sunscreen, and impurities while maintaining the skin’s natural moisture. Enriched with Rice Bran and Fermented Grain Extracts , it purifies and brightens dull skin, leaving it soft, radiant, and refreshed without any greasy residue. Perfect for all skin types, including sensitive and dry skin. Product contains: Rice Bran Water (30%) – rich in amino acids, minerals, and vitamins that brighten, hydrate, and refine skin texture. Fermented Grain Extracts – gently exfoliate and purify the skin, enhancing smoothness and glow. Oat Kernel Oil – nourishes and soothes, strengthening the skin barrier while maintaining comfort. Jojoba Seed Oil – balances oil levels and provides lightweight hydration. Ginseng Seed Oil – delivers antioxidant protection and promotes elasticity and vitality. Tocopherol (Vitamin E) – protects against free radical damage and enhances skin softness. Product effects: effectively removes makeup, sunscreen, and impurities, hydrates and nourishes without leaving residue, brightens and refines dull skin tone, soothes and softens the skin, leaves skin clean, smooth, and radiant. Our cosmetologist recommends this product in case of: dryness, dullness, or uneven texture, clogged pores or makeup buildup, sensitivity to harsh cleansers, need for a gentle, hydrating cleansing step. How to use: Scoop an appropriate amount with dry hands and gently massage onto dry skin to dissolve makeup and impurities. Add a small amount of lukewarm water to emulsify the balm into a milky texture. Rinse thoroughly and follow with your regular cleanser if desired. Capacity: 100 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"100ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/beauty-of-joseon-balsamo-desmaquillante-radiance-1-84657-600x677.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/beauty-of-joseon-radiance-cleansing-balm-100-ml\/"
  },
  {
    "product_name":"Cos de BAHA – (VA) Vitamin C 15% Serum, 30ml",
    "brand":"Cos de BAHA",
    "category":"Bulk Serums, Cos de BAHA",
    "ingredients":"Cos De BAHA – VA Vitamin C 15% Serum – 30 ml – a high-potency brightening serum formulated with 15% L-Ascorbic Acid (Vitamin C) , designed to fade dark spots, even out skin tone, and boost radiance while supporting the skin’s moisture barrier. Product contains: L-Ascorbic Acid (15%) – a powerful antioxidant that helps brighten skin tone, reduce pigmentation, and stimulate collagen production. Arbutin – supports targeted brightening by inhibiting melanin production for clearer, brighter skin. Panthenol (Vitamin B5) – hydrates deeply, soothes skin and strengthens the skin barrier for lasting comfort. Sodium Hyaluronate (Hyaluronic Acid) – draws in and retains moisture, leaving the skin soft, plump and smooth. Botanical Extracts (Aloe Vera, Camellia Sinensis Leaf, Momordica Charantia Fruit, Sambucus Nigra Flower, Leontopodium Alpinum Extract) – nourish, calm and protect the skin from external stressors. Product effects: brightens dull or uneven skin tone and reduces the appearance of dark spots, supports collagen and skin firmness while improving elasticity, hydrates and maintains a healthy moisture balance, protects skin from environmental damage and imparts a radiant glow, leaves skin clear, smooth and visibly refreshed. Recommended for: skin with visible dark spots, hyperpigmentation or post-acne marks, dull or uneven complexion needing a glow boost, early signs of aging such as loss of firmness or texture changes, skin ready for a daytime brightening serum (use in conjunction with sunscreen). How to use: After cleansing and toning, apply 2–3 drops of the serum evenly to the face and neck. Gently pat until fully absorbed. Follow with a moisturizer and always apply broad-spectrum sunscreen in the morning. Start with once a day and increase to morning and evening as tolerated. Capacity: 30 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"30ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/18-2-600x600.avif",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/cos-de-baha-va-vitamin-c-15-serum-30ml\/"
  },
  {
    "product_name":"COSRX – Centella Blemish Cream, 30ml",
    "brand":"COSRX",
    "category":"Bulk Moisturizer, COSRX",
    "ingredients":"COSRX – Centella Blemish Cream – 30 ml – a targeted soothing cream formulated with Centella Asiatica to calm irritation, reduce redness, and support the recovery of troubled or sensitised skin. Product contains: Centella Asiatica Extract – a renowned calming botanical that helps soothe irritation, reduce visible redness, and promote skin repair. Zinc Oxide – helps control excess sebum, supports blemish-prone skin, and provides mild protective benefits. Tea Tree Leaf Oil – known for its purifying properties that assist in reducing blemishes and calming upset skin. Hydrating and barrier-supporting emollients – help maintain moisture and reinforce the skin barrier without clogging pores. Product effects: visibly calms irritated or inflamed skin, reduces redness and supports the healing of blemish-prone areas, helps balance oil levels and minimises the look of problem spots, leaves skin looking clearer, soothed, and more even-toned. Recommended for: irritated, red, or blemish-prone skin needing targeted soothing care, localised problem areas that require calming and protection, those looking for a gentle, non-greasy cream to support skin recovery, all skin types; ideal for sensitive or reactive skin. How to use: Apply a small amount to affected or irritated areas after cleansing and toning. Gently pat until absorbed. Follow with your regular moisturizer. Use morning and\/or evening as needed. Capacity: 30 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"30ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/kremas-nuo-spuogu-centella-blemish-cream-800x800_0-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/cosrx-centella-blemish-cream-30ml\/"
  },
  {
    "product_name":"COSRX – The Retinol 0.1 Cream, 20ml",
    "brand":"COSRX",
    "category":"Bulk Moisturizer, Bulk Serums, COSRX",
    "ingredients":"COSRX – The Retinol 0.1 Cream – 20 ml – a beginner-friendly night cream powered by 0.1% pure retinol , designed to gently improve skin elasticity, smooth fine lines and refine texture while maintaining comfort and supporting the skin barrier. Product contains: Retinol (0.1%) – boosts skin renewal, targets early signs of aging and refines texture. Panthenol (Vitamin B5) – hydrates and soothes to reduce potential irritation. Adenosine – supports improved elasticity and smoother appearance. Tocotrienol (Vitamin E) – antioxidant protection to enhance skin resilience. Sodium Hyaluronate & Hydrolyzed Hyaluronic Acid – deliver layered hydration and help maintain moisture balance. Product effects: smooths fine lines and early wrinkles, refines rough or uneven skin texture, improves firmness and elasticity, hydrates while strengthening the barrier, leaves skin softer, brighter and more youthful-looking. Recommended for: beginners to retinol or those with sensitive skin, early signs of aging such as fine lines or loss of bounce, dull or uneven skin needing gentle renewal, anyone seeking a mild, hydrating retinol cream for nightly use. How to use: In the evening, after cleansing and toning, apply a small amount (around a rice-grain size) to the face and neck. Start by using 1–3 times per week, then gradually increase as your skin adjusts. Always use sunscreen during the day when using retinol products. Capacity: 20 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"20ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/04\/COSRX-The-Retinol-0.1-Cream-20ml-1000x1000.jpg-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/cosrx-the-retinol-0-1-cream-20ml\/"
  }
]