[
  {
    "product_name":"Anua – Centella Red Spot Cream, 30ml",
    "brand":"Anua",
    "category":"Bulk Moisturizer, Anua",
    "ingredients":"Anua – Centella Red Spot Cream – 30 ml – a soothing and restorative cream formulated to calm irritation, reduce redness, and support skin recovery. Enriched with Centella Asiatica Extract and Calamine , it targets sensitive and troubled areas, helping to balance sebum, soothe inflammation, and strengthen the skin barrier. Its lightweight, non-greasy texture absorbs quickly, leaving the skin refreshed, hydrated, and clear — ideal for acne-prone or irritated skin. Product contains: Centella Asiatica Extract – promotes healing, reduces inflammation, and strengthens the skin barrier. Calamine – soothes redness, relieves irritation, and provides a gentle cooling effect. Tea Tree Leaf Extract – purifies the skin, helping to prevent breakouts and reduce blemishes. Niacinamide (Vitamin B3) – brightens the skin, refines pores, and improves overall texture. Panthenol (Vitamin B5) – hydrates and soothes the skin while supporting regeneration. Allantoin – softens and protects, enhancing comfort and smoothness. Product effects: calms redness and irritation, helps reduce acne and blemish spots, promotes faster skin recovery, controls excess sebum and minimizes pores, leaves skin balanced, hydrated, and clear. Our cosmetologist recommends this product in case of: acne-prone, sensitive, or irritated skin, visible redness or inflammation, post-acne marks or uneven skin texture, need for gentle yet effective spot care. How to use: Apply an appropriate amount to affected or irritated areas after cleansing and toning. Gently pat until absorbed. Can be used daily, morning and evening. Capacity: 30 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"30ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/08\/res_6683722832355c36b4bf2a773ef47f32.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-centella-red-spot-cream-30ml\/"
  },
  {
    "product_name":"Anua – Heartleaf Succinic Moisture Cleansing Foam, 150ml",
    "brand":"Anua",
    "category":"Cleanser Wholesale, Anua",
    "ingredients":"Anua – Heartleaf Succinic Moisture Cleansing Foam – 150 ml – a gentle, purifying cleanser that removes impurities and excess sebum while maintaining the skin’s natural moisture balance. Infused with Heartleaf (Houttuynia Cordata) Extract and Succinic Acid , it helps to calm irritation, prevent breakouts, and purify pores without stripping the skin. The rich, creamy foam leaves the skin clean, refreshed, and hydrated — ideal for sensitive, combination, or acne-prone skin types. Product contains: Heartleaf (Houttuynia Cordata) Extract – soothes inflammation, calms redness, and provides antibacterial benefits to protect sensitive or acne-prone skin. Succinic Acid – gently exfoliates, clears pores, and regulates sebum production for smoother, clearer skin. Panthenol (Vitamin B5) – hydrates and strengthens the skin barrier, maintaining softness and comfort. Centella Asiatica Extract – promotes healing, reduces irritation, and enhances overall skin resilience. Glycerin – attracts and retains moisture, preventing tightness after cleansing. Allantoin – softens, soothes, and protects the skin. Product effects: gently removes dirt, oil, and makeup residue, purifies and refines pores without over-drying, soothes irritation and helps prevent acne, balances sebum and moisture levels, leaves skin fresh, soft, and hydrated. Our cosmetologist recommends this product in case of: oily, combination, or acne-prone skin, redness, sensitivity, or irritation, dull, congested complexion, need for gentle daily cleansing without tightness. How to use: Dispense a small amount and lather with water to create foam. Massage gently onto damp skin in circular motions. Rinse thoroughly with lukewarm water and pat dry. Capacity: 150 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"150ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/08\/Anua-Heartleaf-Succinic-Moisture-Cleansing-Foam-3-800x800-1-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-heartleaf-succinic-moisture-cleansing-foam-150ml\/"
  },
  {
    "product_name":"Amuse – Dew Balm, 06 Dew Rose, 3.2g",
    "brand":"Amuse",
    "category":"Lip Gloss Wholesale, Wholesale Makeup Products, Amuse",
    "ingredients":"Amuse – Dew Balm 06 Dew Rose – 3.2 g – a moisturizing, glossy lip balm that enhances the lips with a soft rosy tint and a fresh dewy finish. Infused with plant-derived oils and vegan moisturizing ingredients , it provides long-lasting hydration and nourishment while creating a naturally plump and radiant look. The shade 06 Dew Rose offers a romantic rose hue with a hint of warmth, perfect for adding a touch of effortless elegance to any look. Product contains: Shea Butter – intensely moisturizes and soothes dry, chapped lips, forming a protective layer that prevents moisture loss. Moringa Oil – rich in vitamins and antioxidants, it nourishes and softens lips while improving their elasticity. Plum Seed Oil – replenishes hydration, giving lips a smooth, healthy glow. Hyaluronic Acid – delivers deep hydration, keeping the lips plump and supple throughout the day. Vegan Wax Complex – ensures a smooth glide and non-sticky texture with a natural luminous finish. Product effects: provides a dewy, glossy finish with a rosy tint, deeply hydrates and nourishes the lips, softens and smooths texture, enhances the natural color for a healthy glow, protects lips from dryness and external aggressors. Our cosmetologist recommends this product in case of: dry, dehydrated, or sensitive lips, dull or pale lip tone, need for a natural rosy tint with moisture care, daily use for smooth, glossy, and healthy lips. How to use: Apply directly to the lips whenever needed. Use alone for a fresh dewy look or over lipstick for enhanced shine and comfort. Capacity: 3.2 g Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"2g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/06\/12-1.avif",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/amuse-dew-balm-06-dew-rose-3-2g\/"
  },
  {
    "product_name":"Anua – Moisturizing cream PDRN Hyaluronic Acid 100, 60ml",
    "brand":"Anua",
    "category":"Bulk Moisturizer, Anua",
    "ingredients":"Anua – Moisturizing Cream PDRN Hyaluronic Acid 100 – 60 ml – a deeply hydrating and restorative cream formulated with PDRN (Polydeoxyribonucleotide) and Hyaluronic Acid to repair, plump, and revitalize tired skin. This rich yet lightweight cream delivers intensive moisture, strengthens the skin barrier, and enhances elasticity while soothing irritation. Ideal for dry, dehydrated, or damaged skin, it leaves the complexion firm, supple, and radiant. Product contains: PDRN (Polydeoxyribonucleotide) – promotes cell regeneration, improves elasticity, and accelerates skin repair for a healthy, youthful appearance. Hyaluronic Acid – provides multi-layer hydration, keeping the skin plump and moisturized throughout the day. Panthenol (Vitamin B5) – soothes, hydrates, and helps strengthen the skin’s protective barrier. Niacinamide (Vitamin B3) – brightens dull skin, refines pores, and evens out skin tone. Centella Asiatica Extract – calms irritation and supports healing for sensitive or stressed skin. Allantoin – softens and comforts the skin while reducing redness. Product effects: delivers deep and lasting hydration, promotes regeneration and strengthens the skin barrier, improves elasticity and smoothness, brightens and evens out the complexion, leaves skin supple, firm, and radiant. Our cosmetologist recommends this product in case of: dry, dehydrated, or mature skin, weakened or damaged skin barrier, dullness, rough texture, or fine lines, post-treatment or sensitized skin needing repair. How to use: After cleansing and applying toner and serum, take an appropriate amount and apply evenly to the face and neck. Gently massage until fully absorbed. Use morning and evening as the final step of your skincare routine. Capacity: 60 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"60ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/08\/anua-crema-hidratante-con-pdrn-y-acido-hialuronico-100-1-89782-600x677.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-moisturizing-cream-pdrn-hyaluronic-acid-100-60ml\/"
  },
  {
    "product_name":"Abib – Gummy Sheet Mask Sedum Hyaluron sticker, 27ml",
    "brand":"ABIB",
    "category":"Face Masks Wholesale, ABIB",
    "ingredients":"Abib – Gummy Sheet Mask (Sedum Hyaluron Sticker) – 27 ml – a deeply hydrating, moisture-locking sheet mask designed to flood the skin with hydration and improve elasticity. Infused with sedum extract and hyaluronic acid, its unique gummy “sticker” sheet adheres tightly to the skin to deliver intensive moisture and leave the complexion plump, smooth, and refreshed. Product contains: Sedum Sarmentosum Extract – helps strengthen the moisture barrier and supports long-lasting hydration. Hyaluronic Acid – deeply hydrates and plumps the skin for a smooth, supple look. Panthenol (Vitamin B5) – soothes irritation and improves skin comfort while supporting barrier health. Allantoin – calms sensitive skin and enhances softness. Botanical Extracts – nourish and provide antioxidant support. Gummy Sticker Sheet Material – adheres closely to the skin for optimal absorption and enhanced moisture retention. Product effects: delivers deep hydration and prevents moisture loss, plumps and smooths dry or rough texture, strengthens the moisture barrier and improves elasticity, calms irritation and restores comfort, leaves the complexion soft, dewy, and refreshed. Recommended for: dry, dehydrated, or tight skin, dull complexion needing moisture and plumping care, sensitive skin needing soothing hydration, those seeking a long-lasting moisture sheet mask, all skin types, including sensitive. How to use: After cleansing and toning, apply the mask evenly onto the face. Leave on for 10–20 minutes, then remove. Gently pat in the remaining essence to aid absorption. Follow with moisturizer if desired. Capacity: 27 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"27ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2026\/01\/161_8809562558293_20250727003949148.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-gummy-sheet-mask-sedum-hyaluron-sticker-27ml\/"
  },
  {
    "product_name":"Amuse – Jel-Fit Tint, 08 Georgeous Mauve",
    "brand":"Amuse",
    "category":"Lipstick Wholesale, Wholesale Makeup Products, Amuse",
    "ingredients":"Amuse – Jel-Fit Tint 08 Gorgeous Mauve – a glossy, hydrating lip tint that delivers elegant color with a translucent, jelly-like shine. Formulated with vegan moisturizing ingredients and fruit extracts , it provides long-lasting hydration and a smooth, plump finish. The shade 08 Gorgeous Mauve is a refined mauve-rose with cool undertones — chic, feminine, and perfect for enhancing natural beauty with a soft yet sophisticated glow. The lightweight, gel texture glides effortlessly without stickiness, leaving lips fresh, glossy, and comfortable. Product contains: Peach Extract – nourishes and softens the lips while providing antioxidant protection. Mango Extract – deeply moisturizes and smooths dry, rough lips. Hyaluronic Acid – locks in moisture for lasting hydration and plumpness. Jojoba Seed Oil – helps protect the lips’ natural barrier while adding a silky shine. Vegan Gel Complex – creates a jelly-like texture that ensures even color and luminous finish. Product effects: delivers a glossy, jelly-like finish with elegant mauve color, hydrates and smooths the lips, enhances natural tone with a chic, cool undertone, provides long-lasting moisture and shine, keeps lips soft, plump, and radiant without stickiness. Our cosmetologist recommends this product in case of: dry, sensitive, or dull lips, need for a moisturizing tint with a sophisticated tone, preference for cool pink or mauve shades, daily use for a polished, elegant lip look. How to use: Apply evenly to the lips using the applicator. Reapply as desired for a deeper color or extra shine. Capacity: not specified (standard 4 g). Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"4 g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/06\/d5763919-25b6-4efc-bd45-784cfe6cd447-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/amuse-jel-fit-tint-08-georgeous-mauve\/"
  },
  {
    "product_name":"Amuse – Dew Balm, 05 Amuse Girl, 3.2g",
    "brand":"Amuse",
    "category":"Lip Gloss Wholesale, Wholesale Makeup Products, Amuse",
    "ingredients":"Amuse – Dew Balm 05 Amuse Girl – 3.2 g – a hydrating, glossy lip balm that enhances the lips with a dewy glow and natural color. Formulated with plant-based oils and vegan ingredients , it melts smoothly onto the lips, delivering moisture, comfort, and a luminous finish. The shade 05 Amuse Girl is a soft rosy-pink tone that adds a fresh, youthful look — perfect for everyday use and suitable for all skin tones. Product contains: Shea Butter – deeply moisturizes and protects dry lips, restoring softness and smoothness. Moringa Oil – rich in antioxidants and nutrients, it nourishes and revitalizes the lips while improving elasticity. Plum Seed Oil – enhances hydration, leaving the lips glossy and healthy-looking. Hyaluronic Acid – locks in moisture for a plump, supple appearance. Vegan Wax Complex – provides a smooth, lightweight texture and a comfortable, non-sticky finish. Product effects: delivers a luminous, dewy glow, deeply hydrates and softens lips, enhances natural color with a fresh pink tint, protects against dryness and cracking, leaves lips smooth, glossy, and healthy-looking. Our cosmetologist recommends this product in case of: dry, chapped, or sensitive lips, dull or uneven lip tone, need for a moisturizing balm with a natural tint, daily care and glossy finish without heaviness. How to use: Apply directly to the lips whenever needed. Use alone for a natural glossy look or layer over lipstick for added shine and hydration. Capacity: 3.2 g Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"2g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/06\/30-1.avif",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/amuse-dew-balm-05-amuse-girl-3-2g\/"
  },
  {
    "product_name":"ABIB – PDRN Retinal Eye Patch Glow Jelly, 60EA",
    "brand":"ABIB",
    "category":"Eye Patches Wholesale, ABIB",
    "ingredients":"Abib – PDRN Retinal Eye Patch Glow Jelly – 60 ea – rejuvenating hydrogel eye patches infused with PDRN and retinal to brighten, firm, and smooth the delicate under-eye area. Their cooling jelly texture adheres comfortably to the skin, delivering targeted treatment that reduces fine lines, boosts elasticity, and revives dull, tired eyes with a radiant glow. Product contains: Retinal (Vitamin A Derivative) – promotes gentle skin renewal, smooths fine lines, and improves texture around the eyes. PDRN (Polydeoxyribonucleotide) – supports skin repair, enhances regeneration, and strengthens delicate under-eye skin. Collagen – improves firmness and elasticity while softening wrinkles. Hyaluronic Acid – deeply hydrates and plumps the under-eye area for a smoother, more supple look. Botanical Extracts – soothe irritation, brighten dullness, and provide antioxidant protection. Hydrogel Patch Material – ensures close adhesion and effective delivery of active ingredients with a refreshing feel. Product effects: reduces the appearance of fine lines and early wrinkles, brightens dull or dark under-eyes, improves firmness and elasticity, hydrates deeply and smooths texture, refreshes tired eyes for a radiant, rejuvenated appearance. Recommended for: dull, tired, or dark under-eye area, fine lines, rough texture, or early signs of aging, lack of elasticity or dryness, those seeking firming, brightening eye patches, all skin types (patch test recommended for sensitive skin due to retinal). How to use: After cleansing and toning, use the included spatula to lift two patches. Apply them to the under-eye area and adjust for a comfortable fit. Leave on for 10–20 minutes before removing. Gently pat in any remaining essence. Capacity: 60 patches Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"6g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/11\/res_5eb61e07439fe38db20275d1c223c45b-600x600.avif",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-pdrn-retinal-eye-patch-glow-jelly-60ea\/"
  },
  {
    "product_name":"Amuse – Jel-Fit Tint, 06 Seoul Girl",
    "brand":"Amuse",
    "category":"Lipstick Wholesale, Wholesale Makeup Products, Amuse",
    "ingredients":"Amuse – Jel-Fit Tint 06 Seoul Girl – a glossy, hydrating lip tint that delivers vibrant color with a translucent, jelly-like glow. Infused with vegan moisturizing ingredients and fruit extracts , it provides lasting hydration and a smooth, fresh finish. The shade 06 Seoul Girl is a bright rosy-pink inspired by the lively energy of Seoul — bold yet natural, perfect for a youthful, radiant look. The lightweight formula glides effortlessly onto the lips without stickiness, leaving them plump, glossy, and full of vitality. Product contains: Peach Extract – rich in vitamins and antioxidants, it nourishes and revitalizes lips for a soft, smooth texture. Mango Extract – deeply moisturizes and helps maintain the lips’ natural suppleness. Hyaluronic Acid – retains moisture for a plump, hydrated, and glossy finish. Jojoba Seed Oil – softens and protects lips, keeping them smooth and comfortable. Vegan Gel Complex – gives the tint its signature jelly-like texture for even color and luminous shine. Product effects: delivers a glossy, jelly-like finish with vivid rosy-pink color, deeply hydrates and smooths lips, enhances the natural tone for a fresh, lively look, keeps lips plump, dewy, and comfortable all day, provides long-lasting moisture without stickiness. Our cosmetologist recommends this product in case of: dry, dull, or dehydrated lips, need for a vibrant tint with moisturizing care, preference for glossy, fresh pink shades, daily use for a radiant, healthy lip look. How to use: Apply evenly to the lips using the applicator. Reapply as needed for added color intensity or shine. Capacity: not specified (standard 4 g). Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"4 g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/06\/610wDoiCvML._UF10001000_QL80_-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/amuse-jel-fit-tint-06-seoul-girl\/"
  },
  {
    "product_name":"Amuse – Jel-Fit Tint, 01 Boksoonga Jelly",
    "brand":"Amuse",
    "category":"Lipstick Wholesale, Wholesale Makeup Products, Amuse",
    "ingredients":"Amuse – Jel-Fit Tint 01 Boksoonga Jelly – a glossy, moisturizing lip tint that delivers vivid color with a jelly-like shine and long-lasting hydration. Formulated with vegan moisturizing ingredients and fruit-derived extracts , it melts onto the lips with a cooling, watery texture that feels fresh and comfortable. The shade 01 Boksoonga Jelly is a soft peach-pink inspired by ripe Korean peaches, giving the lips a natural, juicy glow with a glass-like finish. Product contains: Peach Extract – rich in vitamins and antioxidants, it nourishes and revitalizes lips while providing a fruity scent. Mango Extract – softens and hydrates, helping to keep lips smooth and supple. Hyaluronic Acid – locks in moisture and maintains a plump, hydrated look all day. Jojoba Seed Oil – protects against dryness and adds a natural, glossy sheen. Vegan Gel Complex – creates a jelly-like texture for even, smooth color application with a dewy finish. Product effects: delivers glossy, jelly-like color with vibrant shine, moisturizes and softens the lips, provides long-lasting hydration and comfort, enhances natural lip tone with a peachy glow, gives a smooth, plump, and fresh finish without stickiness. Our cosmetologist recommends this product in case of: dry or dull lips needing moisture and shine, desire for a natural yet vivid lip tint, preference for glossy, non-sticky formulas, daily use for hydrated and radiant lips. How to use: Apply evenly to the lips using the applicator. Layer for a more intense color or blend gently for a natural, dewy look. Capacity: not specified (standard 4 g). Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"4 g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/06\/res_ee7af9891076a2573aa62d40905e679e.avif",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/amuse-jel-fit-tint-01-boksoonga-jelly\/"
  },
  {
    "product_name":"A’pieu – Hamamelis Cream, 50ml",
    "brand":"A'PIEU",
    "category":"Bulk Moisturizer, A'PIEU",
    "ingredients":"A’pieu – Hamamelis Cream – 50 ml – a lightweight yet effective cream formulated with over 77% Hamamelis (witch-hazel) extract to regulate excess sebum, tighten pores and strengthen the skin barrier, leaving the skin feeling refreshed and smooth. Product contains: Hamamelis Virginiana (Witch Hazel) Water (77%+) – helps to soothe the skin, tighten pores and control oil without heaviness. Niacinamide – supports brightening, refines texture and improves skin control of sebum. Argania Spinosa Kernel Oil & Sesame Seed Oil – nourishing oils that provide gentle emollience and help calm skin. Adenosine – enhances elasticity and contributes to a smoother skin appearance. Botanical extracts (Rhus Semialata Gall Extract, Serenoa Serrulata Fruit Extract, etc.) – help soothe irritation and protect the skin’s surface. Product effects: helps control excess oil and shine, tightens and refines appearance of pores, strengthens the skin barrier and supports resilience, provides hydration with a fresh finish and no heavy residue, leaves skin balanced, smoother and ready for makeup or moisturizer. Recommended for: oily, combination or breakout-prone skin that needs lightweight barrier support, visible pores or excess sebum needing refinement, skin that prefers a non-greasy texture and wants makeup to sit better, anyone seeking a supportive cream for daily barrier maintenance. How to use: After cleansing and toning (and applying any serums), take an appropriate amount of cream and apply evenly to the face. Gently massage or pat for better absorption. Use morning and night as desired. Capacity: 50 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"50ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/11\/rum_pl_Apieu-Hamamelis-Cream-Crema-cu-extract-de-hamamelis-50-ml-7551_1-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/apieu-hamamelis-cream-50ml\/"
  },
  {
    "product_name":"Anua – Peach 70 Niacin Serum Mask, 25ml – 1 piece",
    "brand":"Anua",
    "category":"Face Masks Wholesale, Under €5, Anua",
    "ingredients":"Anua – Peach 70 Niacin Serum Mask – 25 ml (1 piece) – a brightening and hydrating sheet mask infused with 70% Peach Extract and Niacinamide to revitalize dull skin and promote a healthy, radiant glow. The lightweight, serum-soaked sheet adheres perfectly to the skin, delivering deep moisture and nutrients that leave the complexion soft, luminous, and refreshed. Ideal for all skin types, especially those looking to restore brightness and smooth texture. Product contains: Peach Extract (70%) – rich in vitamins and antioxidants, it brightens dull skin, refines texture, and provides a natural glow. Niacinamide (Vitamin B3) – improves uneven skin tone, minimizes pores, and strengthens the skin barrier for smoother, clearer skin. Hyaluronic Acid – deeply hydrates and plumps the skin, maintaining a dewy, supple appearance. Panthenol (Vitamin B5) – soothes, softens, and replenishes the skin with lasting hydration. Allantoin – calms irritation and promotes smooth, comfortable skin. Centella Asiatica Extract – soothes and helps repair sensitive or stressed skin. Product effects: brightens and revitalizes dull or tired skin, deeply hydrates and softens, improves texture and elasticity, evens out skin tone and boosts radiance, leaves skin fresh, glowing, and nourished. Our cosmetologist recommends this product in case of: dull, uneven, or tired-looking skin, dryness or lack of glow, sensitivity or irritation from environmental stress, need for quick hydration and radiance boost. How to use: After cleansing and toning, apply the mask evenly onto the face. Leave on for 10–20 minutes, then remove and gently pat remaining serum into the skin until absorbed. Use 2–3 times a week or whenever your skin needs an instant glow-up. Capacity: 25 ml (1 piece) Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"25ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/08\/Anua-Peach-70-Niacin-Serum-Mask-25ml-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-peach-70-niacin-serum-mask-25ml-1-piece\/"
  },
  {
    "product_name":"Amuse – Jel-Fit Tint, 04 Rose Milk",
    "brand":"Amuse",
    "category":"Lipstick Wholesale, Wholesale Makeup Products, Amuse",
    "ingredients":"Amuse – Jel-Fit Tint 04 Rose Milk – a glossy, moisturizing lip tint that envelops the lips in soft color and a dewy, jelly-like shine. Formulated with vegan hydrating ingredients and fruit extracts , it delivers long-lasting moisture and a smooth, plump finish. The shade 04 Rose Milk is a gentle rose-pink with a milky undertone, creating a delicate and feminine look that brightens the complexion. Its lightweight texture glides effortlessly onto the lips, leaving them glossy, supple, and naturally radiant. Product contains: Peach Extract – rich in vitamins and antioxidants, it nourishes and revitalizes lips for a soft, smooth texture. Mango Extract – provides deep hydration, keeping lips moisturized and fresh. Hyaluronic Acid – locks in moisture and maintains long-lasting plumpness. Jojoba Seed Oil – softens and protects lips while adding a natural sheen. Vegan Gel Complex – creates the signature jelly-like texture that ensures even color and a dewy finish. Product effects: delivers a glossy, jelly-like shine with soft rose color, hydrates and nourishes lips for a supple feel, enhances natural tone with a milky pink glow, keeps lips smooth, hydrated, and comfortable all day, provides a fresh, radiant finish without stickiness. Our cosmetologist recommends this product in case of: dry, dull, or uneven lip tone, need for moisturizing color with glossy finish, preference for soft, romantic pink tones, daily wear for a natural and elegant look. How to use: Apply evenly to the lips using the applicator. Layer for a more intense rosy tone or apply lightly for a subtle, dewy tint. Capacity: not specified (standard 4 g). Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"4 g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/06\/611469448-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/amuse-jel-fit-tint-04-rose-milk\/"
  },
  {
    "product_name":"Abib – Jericho Rose Creme Nutrition Tube, 75ml",
    "brand":"ABIB",
    "category":"Bulk Moisturizer, ABIB",
    "ingredients":"Abib – Jericho Rose Creme Nutrition Tube – 75 ml – a deeply nourishing and moisture-repairing cream formulated with Jericho Rose extract to revive dry, dehydrated skin and strengthen the moisture barrier. Its rich yet comfortable texture absorbs smoothly, delivering long-lasting hydration and softness while leaving the complexion supple, calm, and well-protected. Product contains: Jericho Rose (Resurrection Plant) Extract – known for intense moisture retention, helps restore hydration and improve skin resilience. Ceramide Complex – strengthens the skin barrier and helps prevent moisture loss. Hyaluronic Acid – deeply hydrates and plumps the skin for a smoother appearance. Panthenol (Vitamin B5) – soothes irritation and supports barrier repair. Shea Butter – nourishes and softens dry, rough skin for improved comfort. Botanical Extracts – calm and protect the skin with antioxidant benefits. Rich Cream Nutrition Base – provides lasting moisture without feeling overly heavy. Product effects: deeply nourishes and hydrates dry skin, strengthens the skin barrier and reduces moisture loss, soothes tightness and improves skin comfort, softens rough texture and enhances smoothness, leaves the complexion supple, calm, and healthy-looking. Recommended for: dry, dehydrated, or tight skin, weakened skin barrier needing nourishment, rough texture and lack of softness, those seeking a rich daily moisturizing cream, all skin types, including sensitive (especially beneficial for dry skin). How to use: Apply an appropriate amount to clean, toned skin as the final step of your routine. Gently massage until fully absorbed. Use morning and evening for best results. Capacity: 75 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"75ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2026\/01\/Abib-Jericho-Rose-Creme-Nutrition-Tube-75ml-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-jericho-rose-creme-nutrition-tube-75ml\/"
  },
  {
    "product_name":"Anua – BHA 2 Gentle Exfoliating Toner, 150ml",
    "brand":"Anua",
    "category":"Bulk Toners, Anua",
    "ingredients":"Anua – BHA 2 Gentle Exfoliating Toner – 150 ml – a mild exfoliating toner formulated with 2% BHA (Salicylic Acid) to unclog pores, smooth skin texture, and balance sebum production. Enriched with Centella Asiatica and Tea Tree Leaf Extract , it soothes irritation while gently removing dead skin cells and impurities. The lightweight, refreshing texture refines the complexion without dryness or tightness, leaving the skin clear, balanced, and radiant — ideal for oily, combination, or acne-prone skin. Product contains: BHA (Salicylic Acid 2%) – exfoliates inside pores, removes excess sebum and dead skin cells, and helps prevent blackheads and breakouts. Centella Asiatica Extract – calms inflammation, promotes healing, and strengthens the skin barrier. Tea Tree Leaf Extract – purifies and refreshes the skin while minimizing acne-causing bacteria. Panthenol (Vitamin B5) – deeply hydrates and soothes, maintaining balance and comfort after exfoliation. Allantoin – softens and protects sensitive skin, helping to reduce redness and irritation. Hyaluronic Acid – provides lasting hydration, ensuring the skin remains smooth and plump. Product effects: gently exfoliates and clears clogged pores, smooths rough skin texture and evens out tone, reduces excess sebum and breakouts, soothes irritation and hydrates simultaneously, leaves skin soft, refreshed, and radiant. Our cosmetologist recommends this product in case of: oily, combination, or acne-prone skin, clogged pores or blackheads, rough texture or dull complexion, need for gentle, non-stripping exfoliation. How to use: After cleansing, apply an appropriate amount to a cotton pad and gently wipe over the face, avoiding the eye and lip areas. Use 2–3 times a week, gradually increasing frequency if tolerated. Follow with serum and moisturizer. Use sunscreen during the day when applying exfoliating products. Capacity: 150 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"150ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/08\/Anua-BHA-2-Gentle-Exfoliating-Toner-150ml-1080x1080.jpg-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-bha-2-gentle-exfoliating-toner-150ml\/"
  },
  {
    "product_name":"Anua – Brightening Niacinamide 5 + TXA 210ml, 60 pads",
    "brand":"Anua",
    "category":"Bulk Toners, Anua",
    "ingredients":"Anua – Brightening Niacinamide 5 + TXA Pads – 210 ml (60 ea) – brightening and tone-correcting toner pads designed to improve dullness, fade dark spots, and even out the complexion. Infused with 5% Niacinamide and Tranexamic Acid (TXA) , they help inhibit pigmentation and boost radiance while hydrating and smoothing the skin. The dual-sided pads gently exfoliate with one textured surface and deliver moisture with the smooth side — perfect for restoring a clear, luminous, and healthy glow. Product contains: Niacinamide (5%) – brightens dull skin, minimizes pores, improves texture, and strengthens the skin barrier. Tranexamic Acid (TXA) – helps reduce hyperpigmentation and dark spots while enhancing overall radiance. Vitamin C Derivatives – provide antioxidant protection and boost brightness for an even skin tone. Panthenol (Vitamin B5) – soothes and hydrates, preventing irritation and dryness. Allantoin – calms sensitive skin and supports a smooth, supple texture. Hyaluronic Acid – deeply hydrates, locking in moisture for long-lasting softness. Product effects: brightens and evens out the skin tone, fades dark spots and discoloration, smooths texture and refines pores, provides lasting hydration and glow, leaves skin luminous, fresh, and revitalized. Our cosmetologist recommends this product in case of: dull, uneven, or tired-looking skin, pigmentation, acne marks, or dark spots, rough or uneven texture, need for daily brightening and hydration care. How to use: After cleansing, use the embossed side of the pad to gently wipe across the face, avoiding the eye and lip areas. Flip the pad and use the smooth side to deliver remaining essence into the skin. Use daily, morning or evening. Always apply sunscreen during the day when using brightening products. Capacity: 210 ml (60 pads) Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"210ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/08\/anua-us-toner-60-ea-niacinamide-5-txa-brightening-pad-1178755388-2-1-fotor-bg-remover-2025111812131-1.png",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-brightening-niacinamide-5-txa-210ml-60-pads\/"
  },
  {
    "product_name":"Amuse – Eye color palette, 01 Warm Boksoonga",
    "brand":"Amuse",
    "category":"Eyeshadow Palettes Wholesale, Wholesale Makeup Products, Amuse",
    "ingredients":"Amuse – Eye Color Palette 01 Warm Boksoonga – a vegan, multi-texture eyeshadow palette inspired by the soft warmth of Korean peaches ( boksoonga ). It features a balanced mix of matte, shimmer, and glitter shades in warm peach, coral, and beige tones — perfect for creating natural daytime looks or luminous evening styles. The finely milled, silky formula blends effortlessly, offering smooth application, vivid color payoff, and long-lasting wear without creasing. The 01 Warm Boksoonga palette enhances the eyes with a healthy, radiant glow and a touch of peachy warmth that flatters all skin tones. Product contains: Moringa Oil – hydrates and nourishes delicate eyelid skin, ensuring smooth blending. Shea Butter – provides softness and helps pigments adhere evenly to the skin. Jojoba Seed Oil – adds moisture and prevents dryness or flaking. Hyaluronic Acid – maintains hydration and comfort throughout the day. Vegan Mineral Pigments – deliver vibrant, skin-friendly color payoff without irritation. Product effects: offers a harmonious blend of matte, shimmer, and glitter finishes, enhances eyes with warm, peachy tones, provides smooth, blendable texture and long wear, hydrates and comforts the skin around the eyes, creates radiant, soft-focus looks for any occasion. Our cosmetologist recommends this product in case of: preference for natural, peach-toned eye makeup, sensitive skin or eyes needing gentle formulas, desire for a versatile palette suitable for daily and evening use, interest in vegan, cruelty-free makeup options. How to use: Apply desired shades to the eyelids using a brush or fingertips. Blend matte shades for definition, use shimmer tones to highlight, and finish with glitter for added dimension and glow. Capacity: not specified (standard compact size). Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"18 g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/06\/26fecb80-45fd-4e86-8f77-8b0d244f6c63.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/amuse-eye-color-palette-01-warm-boksoonga\/"
  },
  {
    "product_name":"Abib – Collagen Gel Mask Heartleaf Jelly, 35g",
    "brand":"ABIB",
    "category":"Face Masks Wholesale, ABIB",
    "ingredients":"Abib – Collagen Gel Mask (Heartleaf Jelly) – 35 g – a soothing and firming gel mask infused with collagen and heartleaf extract to calm irritation, hydrate deeply, and improve skin elasticity. Its jelly-like gel sheet adheres closely to deliver intensive moisture and comfort, leaving the complexion plump, smooth, and refreshed with a healthier, more balanced look. Product contains: Collagen – helps improve firmness and elasticity while smoothing fine lines for a plumper appearance. Heartleaf (Houttuynia Cordata) Extract – soothes irritation, reduces redness, and supports clearer, calmer skin. Hyaluronic Acid – deeply hydrates and plumps the skin for a smooth, supple finish. Panthenol (Vitamin B5) – calms sensitivity and strengthens the moisture barrier. Botanical Extracts – nourish and provide antioxidant support for improved skin vitality. Gel Mask Sheet Material – adheres tightly to the skin for optimal absorption with a cooling, refreshing feel. Product effects: calms irritation and reduces redness, improves skin firmness and elasticity, delivers deep hydration and plumping care, smooths rough texture and enhances softness, leaves the complexion refreshed, balanced, and healthier-looking. Recommended for: sensitive, irritated, or redness-prone skin, dry or dehydrated skin needing soothing hydration, loss of firmness or early signs of aging, those seeking a calming yet firming gel mask, all skin types, including sensitive and acne-prone. How to use: After cleansing and toning, apply the gel mask evenly onto the face. Leave on for 10–20 minutes, then remove. Gently pat in the remaining essence until fully absorbed. Follow with moisturizer if desired. Capacity: 35 g Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"35g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2026\/01\/AbibCollagenGelMask-1.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-collagen-gel-mask-heartleaf-jelly-35g\/"
  },
  {
    "product_name":"Amuse – Vegan Face Multi-Functional Blush Eyeshadow Palette, #02 Peach Glow",
    "brand":"Amuse",
    "category":"Eyeshadow Palettes Wholesale, Wholesale Makeup Products, Amuse",
    "ingredients":"Amuse – Vegan Face Multi-Functional Blush Eyeshadow Palette #02 Peach Glow – a versatile, vegan-friendly palette designed for cheeks and eyes. Featuring a harmonious selection of peachy and coral tones with both matte and shimmer finishes, this palette allows you to create radiant, cohesive looks with ease. Its silky, blendable texture ensures smooth application and buildable color, while vegan skincare ingredients provide a comfortable, non-drying finish. The #02 Peach Glow palette delivers a fresh, glowing look that flatters all skin tones — perfect for natural daily makeup or soft glam styles. Product contains: Shea Butter – nourishes and conditions the skin, helping colors apply smoothly and evenly. Moringa Oil – rich in antioxidants and vitamins, it moisturizes and enhances skin vitality. Jojoba Seed Oil – softens the skin and ensures a silky, seamless blend. Hyaluronic Acid – provides lasting hydration, preventing dryness or patchiness. Vegan Mineral Pigments – deliver vibrant, skin-friendly color payoff without irritation. Product effects: offers multi-functional use as blush, eyeshadow, or highlighter, blends effortlessly for a smooth, radiant finish, enhances complexion with natural peachy warmth, hydrates and nourishes the skin while adding color, provides both matte and shimmer tones for versatile looks. Our cosmetologist recommends this product in case of: need for a convenient all-in-one blush and eyeshadow palette, preference for natural, glowing makeup, sensitive skin that benefits from vegan, gentle formulas, daily or travel-friendly makeup options. How to use: Apply desired shades to the eyelids or cheeks using a brush or fingertips. Blend well for a natural gradient or layer for a more defined, luminous look. Capacity: not specified (standard compact size). Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"5g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/06\/AMCM07-CB02.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/amuse-vegan-face-multi-functional-blush-eyeshadow-palette-02-peach-glow\/"
  },
  {
    "product_name":"Abib – Sedum Hyaluron Pad Hydrating Touch, 75pads",
    "brand":"ABIB",
    "category":"Bulk Toners, ABIB",
    "ingredients":"Abib – Sedum Hyaluron Pad Hydrating Touch – 75 pads – deeply hydrating toner pads infused with sedum extract and hyaluronic acid to replenish moisture, soothe dryness, and smooth the skin. Each soft pad delivers a refreshing layer of hydration while gently refining texture, leaving the complexion plump, comfortable, and glowing. Product contains: Sedum Sarmentosum Extract – helps strengthen the moisture barrier and supports long-lasting hydration. Hyaluronic Acid – delivers deep hydration and plumps the skin for a smoother look. Panthenol (Vitamin B5) – soothes irritation and strengthens the skin barrier for improved comfort. Allantoin – calms sensitive skin and enhances softness. Botanical Extracts – nourish and provide antioxidant support. Soft Pad Material – glides gently across the skin for even distribution of essence without irritation. Product effects: replenishes hydration and prevents moisture loss, soothes dryness, tightness, and irritation, smooths rough texture and improves softness, strengthens the moisture barrier for better resilience, leaves the complexion plump, refreshed, and dewy. Recommended for: dry, dehydrated, or tight skin, sensitive skin needing gentle hydration, rough texture or dull complexion, those seeking convenient daily hydrating toner pads, all skin types, including sensitive. How to use: After cleansing, gently swipe a pad across the face, avoiding the eye area. Pat remaining essence into the skin until absorbed. Follow with serum and moisturizer. Use daily or as needed for extra hydration. Capacity: 75 pads Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"150ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2026\/01\/Abib-Sedum-Hyaluron-Pad-Hydrating-Touch-3-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-sedum-hyaluron-pad-hydrating-touch-75pads\/"
  },
  {
    "product_name":"Abib – Pore Cleansing Oil Heartleaf Oil-Wash, 200ml",
    "brand":"ABIB",
    "category":"Cleanser Wholesale, ABIB",
    "ingredients":"Abib – Pore Cleansing Oil (Heartleaf Oil-Wash) – 200 ml – a lightweight cleansing oil formulated with heartleaf extract to dissolve makeup, sunscreen, and excess sebum while calming sensitive or acne-prone skin. Its smooth, non-greasy texture emulsifies easily into a milky rinse, helping unclog pores and leave the skin clean, soft, and comfortably balanced. Product contains: Heartleaf (Houttuynia Cordata) Extract – soothes irritation, reduces redness, and supports clearer-looking skin. Plant-Derived Cleansing Oils – melt away makeup, sunscreen, and impurities without stripping moisture. Sebum-Control Ingredients – help balance oiliness and reduce the appearance of clogged pores. Botanical Extracts – nourish and protect the skin with antioxidant support. Lightweight Emulsifying Oil Base – transforms into a milky texture for easy, residue-free rinsing. Product effects: removes makeup, sunscreen, and impurities effectively, dissolves excess sebum and helps unclog pores, calms irritation and reduces redness, leaves the skin soft, refreshed, and balanced, supports clearer-looking skin without dryness. Recommended for: oily, combination, or acne-prone skin, clogged pores, blackheads, or excess sebum, sensitive or redness-prone skin needing gentle cleansing, those seeking a lightweight cleansing oil with calming benefits, all skin types. How to use: Apply an appropriate amount to dry hands and gently massage onto a dry face. Add a small amount of water to emulsify into a milky texture. Rinse thoroughly with lukewarm water. Follow with a water-based cleanser if desired. Capacity: 200 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"200ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2026\/01\/Abib-Pore-Cleansing-Oil-Heartleaf-Oil-Wash-1-600x600.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-pore-cleansing-oil-heartleaf-oil-wash-200ml\/"
  },
  {
    "product_name":"A’pieu – Honey & Milk Lip Oil – Mint, 5g",
    "brand":"A'PIEU",
    "category":"Lip Balm Wholesale, Under €5, Wholesale Makeup Products, A'PIEU",
    "ingredients":"A’PIEU – Honey & Milk Lip Oil (Mint) – a hydrating and revitalizing lip oil enriched with honey extract , milk protein , and a refreshing mint complex . This lightweight yet deeply nourishing formula smooths dry, chapped lips while providing a cooling, soothing sensation. It forms a glossy protective layer that locks in moisture and enhances natural lip shine, leaving lips soft, plump, and comfortably refreshed. Product contains: Honey Extract – intensively nourishes, hydrates, and helps repair dry or cracked lips while providing antioxidant protection. Milk Protein Extract – smooths and softens the lips, improving elasticity and texture. Peppermint Extract – delivers a refreshing cooling effect and helps improve blood circulation for naturally rosy lips. Jojoba Seed Oil – replenishes natural moisture and maintains lip softness. Argan Oil – rich in essential fatty acids, protects and conditions the lips. Vitamin E (Tocopherol) – strengthens and protects lips against dryness and environmental stress. Product effects: deeply moisturizes and nourishes, smooths and softens rough lips, delivers a refreshing cooling sensation, adds natural shine and a plumping effect, prevents dryness and chapping, leaves lips fresh, glossy, and comfortable. Our cosmetologist recommends this product in case of: dry, dull, or chapped lips, need for a refreshing lip treatment, discomfort or tightness after matte lipstick, desire for glossy, healthy-looking lips. How to use: Apply evenly to clean lips using the applicator. Use as needed throughout the day or before makeup for a glossy, smooth finish. Can also be applied before bedtime for overnight lip care. Capacity: 5 g Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"5g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/08\/res_3163c4bb6018a9ec6dff6e5d245da85d.avif",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/apieu-honey-milk-lip-oil-mint-5g\/"
  },
  {
    "product_name":"Anua – 8 Hyaluronic Acid Moisturizing Gentle Gel Cleanser, 150ml",
    "brand":"Anua",
    "category":"Cleanser Wholesale, Anua",
    "ingredients":"Anua – 8 Hyaluronic Acid Moisturizing Gentle Gel Cleanser – 150 ml – a mild, moisture-replenishing gel cleanser that gently removes impurities while keeping the skin hydrated and balanced. Formulated with 8 types of Hyaluronic Acid and Panthenol , it delivers deep hydration as it cleanses, leaving the skin refreshed, soft, and comfortable. The low-pH, non-stripping formula makes it ideal for dry, sensitive, or dehydrated skin in need of a soothing daily cleanser. Product contains: 8 Types of Hyaluronic Acid – provide multi-layer hydration, locking in moisture and keeping skin plump and supple. Panthenol (Vitamin B5) – soothes, hydrates, and strengthens the skin barrier to maintain long-lasting comfort. Centella Asiatica Extract – calms irritation, reduces redness, and promotes healing for sensitive skin. Glycerin – replenishes moisture and prevents dryness after cleansing. Allantoin – softens and protects, leaving the skin smooth and calm. Product effects: gently cleanses without stripping moisture, deeply hydrates and softens skin, strengthens the skin barrier, soothes irritation and redness, leaves skin clean, plump, and refreshed. Our cosmetologist recommends this product in case of: dry, dehydrated, or sensitive skin, irritation or tightness after washing, need for a gentle daily cleanser, maintaining balanced hydration during cleansing. How to use: Dispense a small amount into wet hands and lather with water. Gently massage onto damp skin using circular motions. Rinse thoroughly with lukewarm water and pat dry. Capacity: 150 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"150ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/09\/anua-us-cleanser-150ml-8-hyaluronic-acid-moisturizing-gentle-gel-cleanser-1161173145.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-8-hyaluronic-acid-moisturizing-gentle-gel-cleanser-150ml\/"
  },
  {
    "product_name":"A’pieu – Raspberry Hair Vinegar, 200ml",
    "brand":"A'PIEU",
    "category":"Wholesale Hair Oil, A'PIEU",
    "ingredients":"A’PIEU – Raspberry Hair Vinegar – a refreshing hair care treatment formulated with raspberry extract and vinegar to purify the scalp, balance its pH, and smooth the hair cuticles for a radiant, silky finish. This gentle formula removes excess sebum, product buildup, and impurities left after shampooing while maintaining moisture and softness. It leaves the scalp feeling clean and fresh, and the hair glossy, lightweight, and easy to manage. The fruity raspberry scent provides a pleasant, spa-like experience after every wash. Product contains: Raspberry Vinegar – naturally clarifies and detoxifies the scalp, restores pH balance, and enhances shine. Raspberry Extract – rich in antioxidants and vitamins, it nourishes and protects hair from damage caused by environmental factors. Apple Fruit Extract – smooths and softens the hair cuticles, improving texture and adding luminosity. Lactic Acid – gently exfoliates dead skin cells from the scalp and promotes a clean, balanced environment for healthy hair growth. Panthenol (Vitamin B5) – hydrates and strengthens hair, improving elasticity and reducing breakage. Allantoin – soothes scalp irritation and maintains moisture levels for lasting comfort. Product effects: purifies the scalp and removes buildup, balances the scalp’s pH, enhances natural shine and smoothness, improves manageability and softness, helps prevent scalp irritation, leaves hair light, fresh, and radiant. Our cosmetologist recommends this product in case of: oily or flaky scalp, dull and lifeless hair, product or sebum buildup, those seeking a refreshing finish after shampooing. How to use: After shampooing, pour an adequate amount onto the scalp and hair. Gently massage for 1–2 minutes, then rinse thoroughly with lukewarm water. Use 2–3 times per week or as needed for scalp and hair freshness. Capacity: 200 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"200ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/06\/raspberryhairvinegar_1.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/apieu-raspberry-hair-vinegar-200ml\/"
  },
  {
    "product_name":"Anua – PDRN Hyaluronic Acid Capsule 100 Serum Mask, 23ml",
    "brand":"Anua",
    "category":"Face Masks Wholesale, Anua",
    "ingredients":"Anua – PDRN Hyaluronic Acid Capsule 100 Serum Mask – 23 ml – a deeply hydrating and revitalizing sheet mask formulated with PDRN (Polydeoxyribonucleotide) and Hyaluronic Acid Capsules to restore elasticity, plump the skin, and enhance radiance. The serum-rich mask delivers intensive moisture and nourishment, improving the skin’s firmness and smoothness while soothing irritation. Ideal for tired, dry, or mature skin, it leaves the complexion refreshed, dewy, and luminous after just one use. Product contains: PDRN (Polydeoxyribonucleotide) – promotes cell regeneration, strengthens the skin barrier, and improves elasticity for firmer, youthful-looking skin. Hyaluronic Acid Capsules – provide multi-layer hydration, deeply moisturizing and plumping the skin from within. Niacinamide (Vitamin B3) – brightens dull skin, refines texture, and evens out the complexion. Panthenol (Vitamin B5) – soothes and replenishes moisture while maintaining skin softness. Centella Asiatica Extract – calms irritation and supports healing, improving overall skin resilience. Allantoin – softens and smooths, providing comfort to sensitive or dry skin. Product effects: deeply hydrates and locks in moisture, improves firmness and elasticity, brightens dull and uneven skin tone, calms and soothes irritation, leaves skin plump, smooth, and radiant. Our cosmetologist recommends this product in case of: dry, dehydrated, or mature skin, dullness, rough texture, or loss of elasticity, weakened barrier or post-treatment sensitivity, need for intensive, restorative care. How to use: After cleansing and toning, apply the mask evenly onto the face. Leave on for 10–20 minutes, then remove and gently pat remaining essence into the skin until absorbed. Use 2–3 times a week or whenever your skin needs a hydration boost. Capacity: 23 ml (1 piece) Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"23ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/09\/anua-pdrn-hyluronic-acid-capsule-100-serum-mask-8809640737800-1-1.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-pdrn-hyaluronic-acid-capsule-100-serum-mask-23ml\/"
  },
  {
    "product_name":"A’pieu – Honey & Milk Lip Oil, 5g",
    "brand":"A'PIEU",
    "category":"Lip Balm Wholesale, Lip Gloss Wholesale, Under €5, Wholesale Makeup Products, A'PIEU",
    "ingredients":"A’PIEU – Honey & Milk Lip Oil – an intensely moisturizing lip treatment infused with honey extract and milk protein to soften, smooth, and restore dry or chapped lips. This luxurious oil forms a glossy, non-sticky layer that locks in hydration and gives the lips a healthy, radiant shine. Its rich formula nourishes deeply while improving elasticity and preventing moisture loss, leaving lips plump, smooth, and naturally luminous. Product contains: Honey Extract – provides deep nourishment, hydration, and antioxidant protection while helping to repair dry, cracked lips. Milk Protein Extract – smooths and softens the lips, improving elasticity and texture. Jojoba Seed Oil – replenishes natural lip moisture and enhances suppleness. Macadamia Seed Oil – rich in fatty acids, protects lips from dryness and environmental damage. Argan Oil – deeply conditions and restores lip smoothness and comfort. Vitamin E (Tocopherol) – provides antioxidant benefits and promotes healthy, youthful-looking lips. Product effects: deeply nourishes and hydrates dry lips, restores softness and smooth texture, provides long-lasting moisture protection, enhances natural lip shine and plumpness, soothes irritation and prevents chapping, leaves a glossy, comfortable finish without stickiness. Our cosmetologist recommends this product in case of: dry, flaky, or chapped lips, need for daily protection and gloss, dull or dehydrated lips lacking elasticity, after exfoliation or matte lipstick use. How to use: Apply directly to clean lips using the applicator. Use as needed throughout the day to maintain hydration and shine. Can also be applied before bedtime as an intensive overnight lip treatment. Capacity: 5 g Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"5g",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/06\/PdXeDp1ujjZGEjkc.jpg",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/apieu-honey-milk-lip-oil-5g\/"
  },
  {
    "product_name":"Anua – Ultra-Thin Spot Cover Patch, 75ea",
    "brand":"Anua",
    "category":"Pimple Patches Wholesale, Anua",
    "ingredients":"ANUA – Ultra-Thin Spot Cover Patch – 75 pcs – ultra-thin hydrocolloid patches designed to discreetly cover and heal blemishes while providing barrier support and calming care. Product contains: Hydrocolloid film (0.25 mm) – absorbs fluids and sebum from spots, supports faster healing and prevents picking. Ceramide NP – strengthens the skin barrier and helps prevent irritation around blemish zones. Centella Asiatica Extract & Aloe Barbadensis Leaf Extract – soothe redness, calm inflammation and support recovery. Product effects: reduces visible whiteheads, blemish size and redness, protects the affected area from external bacteria and picking, blends naturally into skin with a matte, low-profile finish, supports barrier recovery and leaves skin calmer and better supported. Recommended for: active pimples or raised blemishes that need protection, skin prone to irritation, picking or slow-healing spots, breakout-prone skin needing a discreet hide-and-repair solution under makeup or overnight. How to use: After cleansing and drying the skin, select a patch slightly larger than the blemish. Peel off and apply directly onto the spot, pressing gently for full adhesion. Leave on for up to 8 hours or until the patch turns white with absorbed residue, then remove. Use as needed. Capacity: 75 patches Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/11\/Anua-Ultra-Thin-Spot-Cover-Patch-min.png.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-ultra-thin-spot-cover-patch-75ea\/"
  },
  {
    "product_name":"ABIB – Mild Acidic PH Sheet Mask Honey Fit",
    "brand":"ABIB",
    "category":"Face Masks Wholesale, Under €5, ABIB",
    "ingredients":"Abib – Mild Acidic pH Sheet Mask Honey Fit – a deeply nourishing sheet mask formulated with honey extract and a mild acidic pH (5.5) to strengthen the skin barrier, boost radiance, and lock in moisture. The soft cellulose sheet adheres perfectly to the skin, allowing the rich essence to penetrate deeply. This mask replenishes nutrients, restores elasticity, and delivers a smooth, glowing complexion without stickiness — perfect for dry, dull, or tired skin. Product contains: Honey Extract – rich in vitamins, minerals, and amino acids; deeply nourishes and moisturizes while enhancing elasticity and glow. Propolis Extract – provides antioxidant protection, soothes irritation, and supports skin repair. Royal Jelly Extract – revitalizes and strengthens the skin, improving firmness and smoothness. Panthenol (Vitamin B5) – soothes and hydrates, reinforcing the skin barrier. Allantoin – calms and protects sensitive skin. Niacinamide (Vitamin B3) – brightens the complexion and helps even out tone. Adenosine – improves elasticity and reduces fine lines for smoother skin. Product effects: nourishes and moisturizes deeply, strengthens and repairs the skin barrier, restores radiance and vitality, improves elasticity and smoothness, soothes and softens rough, tired skin, leaves a healthy, luminous finish. Our cosmetologist recommends this product in case of: dry, dehydrated, or dull skin, loss of elasticity or rough texture, tired complexion lacking radiance, skin needing deep nourishment and revitalization. How to use: After cleansing and toning, apply the mask evenly over the face, aligning with the eyes and mouth. Leave on for 10–20 minutes to allow the essence to absorb. Remove and gently pat the remaining essence into the skin until absorbed. Follow with your moisturizer for enhanced nourishment. Capacity: 1 sheet (30 ml) Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"30 ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/08\/mild-acidic-ph-sheet-mask-honey-fit-masca-de-fata-hidratanta-30-ml_26069_1_1718862491-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/abib-mild-acidic-ph-sheet-mask-honey-fit\/"
  },
  {
    "product_name":"Anua – Azelaic Acid 3 Cica Skin Clarifying Toner, 250ml",
    "brand":"Anua",
    "category":"Bulk Toners, Anua",
    "ingredients":"ANUA – Azelaic Acid 3 Cica Skin Clarifying Toner – 250 ml – a soothing and refining toner formulated with 3% Azelaic Acid and a powerful 7-Cica complex to calm redness, improve texture and support clear, balanced skin. Product contains: Azelaic Acid (3%) – reduces visible redness, controls excess oil and helps clear clogged pores. 7-Cica Complex (Centella Asiatica Extract, Asiaticoside, Madecassoside, Asiatic Acid, Madecassic Acid, etc.) – soothes irritation, repairs the skin barrier and supports recovery. Glycyrrhizic Acid – helps brighten tone and fade post-blemish marks. Salicylic Acid & Zinc PCA – provide mild exfoliation and help regulate sebum. Sodium Hyaluronate, Squalane & Ceramide NP – deliver deep hydration, restore moisture and strengthen the skin barrier. Product effects: calms redness and soothes sensitive or irritated skin, refines uneven texture and smooths rough areas, helps control oil and purify pores, brightens skin tone and supports clearer complexion, strengthens the barrier and leaves skin balanced and hydrated. Recommended for: oily, combination or sensitive skin prone to redness, congested pores or uneven skin texture, dull skin with post-blemish marks, anyone seeking a gentle daily toner with clarifying and calming benefits. How to use: After cleansing, apply an appropriate amount of toner using your hands or a cotton pad. Gently sweep or pat across the face until absorbed. Use morning and\/or evening. If used in the morning, follow with sunscreen. Capacity: 250 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"250ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/11\/8809640737992-600x600.webp",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-azelaic-acid-3-cica-skin-clarifying-toner-250ml\/"
  },
  {
    "product_name":"Anua – 8 Hyaluronic Acid Hydrating Gentle Foaming Cleanser, 150ml",
    "brand":"Anua",
    "category":"Cleanser Wholesale, Anua",
    "ingredients":"Anua – 8 Hyaluronic Acid Hydrating Gentle Foaming Cleanser – 150 ml – a mild, moisture-rich facial cleanser that effectively removes impurities while maintaining the skin’s natural hydration balance. Formulated with 8 types of Hyaluronic Acid and Panthenol , it deeply hydrates, soothes, and softens the skin without causing tightness or irritation. The creamy foam texture cleanses thoroughly yet gently, leaving the skin refreshed, smooth, and supple — ideal for dry, sensitive, or dehydrated skin types. Product contains: 8 Types of Hyaluronic Acid – penetrate different layers of the skin to provide multi-level hydration and lock in moisture. Panthenol (Vitamin B5) – soothes and strengthens the skin barrier, preventing dryness and irritation. Centella Asiatica Extract – calms redness and promotes healing for sensitive or reactive skin. Glycerin – delivers deep, lasting hydration and helps maintain the skin’s moisture balance. Allantoin – gently softens and soothes, enhancing post-cleanse comfort. Product effects: gently removes dirt, makeup, and excess sebum, hydrates deeply while cleansing, soothes irritation and prevents dryness, strengthens and protects the skin barrier, leaves skin soft, smooth, and refreshed. Our cosmetologist recommends this product in case of: dry, dehydrated, or sensitive skin, need for a gentle daily cleanser, discomfort or tightness after washing, maintaining moisture while cleansing. How to use: Dispense an appropriate amount and lather with water to create foam. Massage gently onto damp skin using circular motions. Rinse thoroughly with lukewarm water and pat dry. Capacity: 150 ml Expiration date: see packaging. Country of origin: South Korea.",
    "size_packaging":"150ml",
    "product_image_url":"https:\/\/qudobeauty.com\/wp-content\/uploads\/2025\/08\/8809640735561_main-1-600x600.avif",
    "product_page_url":"https:\/\/qudobeauty.com\/product\/anua-8-hyaluronic-acid-hydrating-gentle-foaming-cleanser-150ml\/"
  }
]